[
  {
    "url": "https://www.walmart.com/ip/Apple-iPhone-14-128GB-Blue-Verizon/1736740710",
    "title": "Sony PlayStation 5 Video Game Console",
    "description": "The PS5™ console unleashes new gaming possibilities that you never anticipated. Experience lightning fast loading with an ultra-high speed SSD, deeper immersion with support for haptic feedback, adaptive triggers, and 3D Audio*, and an all-new generation of incredible PlayStation® games.",
    "price": {
      "current": 499,
      "currency": "USD",
      "display": "$499.00",
      "was_price": null,
      "savings": null
    },
    "images": [
      "https://i5.walmartimages.com/seo/Sony-PlayStation-5-Video-Game-Console_9333b8cd-773e-49d4-8e85-51c4114fcd56.bbf5c4e4f3746ddc28ac982117cdbf9a.jpeg",
      "https://i5.walmartimages.com/asr/985f6fea-1255-44f9-a4b1-d26e62ebc6f9.08c17391d3df289f6842e270f7180eec.jpeg",
      "https://i5.walmartimages.com/asr/69c08bf8-207b-4669-81f2-acfa950c4a94.d51028ed9404147f4050401047a6279f.jpeg",
      "https://i5.walmartimages.com/asr/b3a883cc-c414-4818-a687-de74d04f5349.ad369bba070eb7d13a262d55b1a3980d.jpeg"
    ],
    "specifications": {
      "Brand": "PlayStation",
      "Model": "CFI-1215A01X",
      "UPC": "711719556169"
    },
    "brand": "PlayStation",
    "model": "CFI-1215A01X",
    "sku": "4S6KN6TWU0A0",
    "upc": "711719556169",
    "rating": 4.8,
    "review_count": 4499,
    "availability": "OUT_OF_STOCK",
    "category": [
      {
        "name": "Video Games",
        "url": "/cp/video-games/2636"
      },
      {
        "name": "PlayStation",
        "url": "/cp/playstation/5170403"
      },
      {
        "name": "PlayStation 5",
        "url": "/cp/playstation-5/3475115"
      },
      {
        "name": "PlayStation 5 (PS5) Consoles",
        "url": "/cp/playstation-5-ps5-consoles/2762884"
      }
    ],
    "seller": "Walmart.com",
    "scraped_at": "2025-09-15 00:36:13",
    "reviews": [
      {
        "review_id": "396282776",
        "rating": 5,
        "title": null,
        "text": "cam in a timely manner my son love it the only rging i would suggest is the box the playstation 5 comes in they should have something to let people know the other end of the box opens and thats where the cords and controller is located we thought they forgot to put the accessories.",
        "author": "Teresa",
        "date": "8/24/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "300369795",
        "rating": 5,
        "title": "Love my ps5!",
        "text": "After waiting years of it being out of stock I finally got mine with my Tax return. The console itself is large but yet its light, threw me off but it works so well as I expected. I have being playing playstion snice PS1 so this was definitely a great buy and I al ready to see what games are coming in the future!!!!!",
        "author": "Aerogoth",
        "date": "2/12/2023",
        "helpful_count": 26,
        "not_helpful_count": 4,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "301666329",
        "rating": 5,
        "title": "Absolutely love it 😍😍😍",
        "text": "I have owned and loved every PlayStation since the PS1. I ordered this on February 17 2023 with a copy of the Dead Space remake and I absolutely love it. It comes with a game called Astro's Playroom pre-installed which is great because it shows you all the stuuf the DualSense 5 controller can do. It's also just a fun game to play to pass the time. You could easily spend a couple of hours at a time playing Astro's Playroom. I highly recommend buying the PS5 disc edition.",
        "author": "Chris",
        "date": "3/3/2023",
        "helpful_count": 14,
        "not_helpful_count": 1,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "300523008",
        "rating": 5,
        "title": "Ps5 Disc Edition",
        "text": "Im so happy with my ps5. After the release of Hogwarts Legacy, I just couldn’t wait any longer to get my ps5. I was able to get one shipped and sold by Walmart directly while they were in stock for $499. I paired my purchase with a starlight blue cover and matching controller. I couldn’t be happier, especially because the scalpers didn’t get my money. The ps5 itself is in perfect condition. Box undamaged and unopened. Extremely happy to finally got my hands on one.",
        "author": "Kyle",
        "date": "2/15/2023",
        "helpful_count": 13,
        "not_helpful_count": 2,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "296013686",
        "rating": 5,
        "title": "PlayStation did it again! Two thumbs up!",
        "text": "The PS5 is awesome! I have had a ps4 for over 4 years and it was time to upgrade. And we’ll it’s totally worth it. Graphics are amazing, the speed on the console is crazy!",
        "author": "JohnPaul",
        "date": "12/20/2022",
        "helpful_count": 10,
        "not_helpful_count": 3,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "294198020",
        "rating": 4,
        "title": "Happy I finally got one, but....",
        "text": "I was just happy that after 2 years i was able to get one, but the fact that money was taken out only to be returned and then taken out again once the item shipped was unappreciated, if the money was taken out just keep it! no need to \"test to see if the payment system worked\" you already had the money once I ordered it, keep it!",
        "author": "Mae",
        "date": "12/4/2022",
        "helpful_count": 2,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "292262228",
        "rating": 3,
        "title": "Roll the Dice With the Swiss Cheese Box",
        "text": "The box that Walmart ships the PS5 in is absolutely asinine. It has 2 decent size cutouts over the barcodes, which are literal holes in the shipping box itself. These holes expose nearby wording which identify the contents as a PlayStation. Luckily, mine was not stolen, but I was also home to receive it. \n\nFurthermore, either my courier thought the holes made great handles or the holes allowed the package to become snagged on something. Either way, not only was the shipping box torn open, but this also completely ripped up the bottom of the PS5 packaging.\n\nI've never made a stink before, no matter how poor the packaging. However, when I spend $550 on a single item, I expect it to arrive protected....or, at the very least, in a box with all its sides. It's just common sense.",
        "author": "Brandy",
        "date": "11/18/2022",
        "helpful_count": 10,
        "not_helpful_count": 3,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "292944678",
        "rating": 1,
        "title": "Where is PlayStation?!",
        "text": "Well I was suppose to receive this by November 15th, here it is November 24th and no PS5! When I look at the tracking of it all it says is placed! I call Walmart and they tell me to cancel it and buy another one! Are you serious?! So I have to pay atleast $60 more?! I want the PS5 that I originally bought! My mother gave me money toward this on October 16th, she passed on October 18th very unexpectedly. This PlayStation means a lot to my son, plus he works at Walmart! I can't believe I'm have this goose chase like this when I should be mourning my mother, not worried about if my son is going to get his PlayStation or not! I'll gladly change my review when I get the console!",
        "author": "Krystal",
        "date": "11/24/2022",
        "helpful_count": 13,
        "not_helpful_count": 9,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "355537338",
        "rating": 1,
        "title": "Never got package",
        "text": "Zero stars!!! Never received package!!! Still waiting for UPS to finish investigating what happened to it, Walmart was no help at all, if u want a ps5 get it in store don't buy online!!! Walmart will just rip u off!!!",
        "author": "Aj",
        "date": "8/28/2024",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "290864469",
        "rating": 1,
        "title": "AWFUL AWFUL AWFUL",
        "text": "Your delivery was way late. The box was so damaged that I was worried that it my PS5 was going to be broken. And no it was not due to shipping. It was inside the shipping box. The damage occurred before the unit was placed in the shipping box as the shipping box was undamaged. I will never ever order from Walmart again!",
        "author": "Chris",
        "date": "11/8/2022",
        "helpful_count": 7,
        "not_helpful_count": 5,
        "verified_purchase": true,
        "photos": []
      }
    ],
    "total_reviews": 10,
    "review_summary": {
      "average_rating": 4.8,
      "total_count": 4499,
      "rating_distribution": {
        "1": 3,
        "2": 0,
        "3": 1,
        "4": 1,
        "5": 5
      }
    }
  },
  {
    "url": "https://www.walmart.com/ip/Sony-PlayStation-5-PS5-Video-Game-Console/363472942",
    "title": "PlayStation 5 Console",
    "description": "Play has no limits with the PlayStation 5 Console. The PS5 console unleashes new gaming possibilities that you never anticipated. Experience lightning fast loading with an ultra-high speed SSD, deeper immersion with support for haptic feedback, adaptive triggers, and 3D Audio, and an all-new generation of incredible PlayStation games. Harness the power of a custom CPU, GPU, and SSD with Integrated I/O that rewrite the rules of what a PlayStation console can do. Marvel at incredible graphics and experience new PS5 features. Discover a deeper gaming experience with support for haptic feedback, adaptive triggers, and 3D Audio technology. Maximize your play sessions with near-instant load times for PS5 games. And the custom integration of the PS5 console's systems lets creators pull data from the SSD so quickly that they can design games in ways never before possible. Play has no limits with the PlayStation 5 Console.",
    "price": {
      "current": 499,
      "currency": "USD",
      "display": "$499.00",
      "was_price": null,
      "savings": null
    },
    "images": [
      "https://i5.walmartimages.com/seo/PlayStation-5-Console_b29e7500-cac2-4d1f-b4aa-5e0ebb3de124.c0b04249d968e2c1e5d25799b96ee0e3.jpeg",
      "https://i5.walmartimages.com/asr/4e7deb33-3a02-4ec2-9fda-a07ea139f600.946f9cdaef0a37afef8dc18fa74288f1.jpeg"
    ],
    "specifications": {
      "Brand": "PlayStation",
      "Model": "CFI-1015A",
      "UPC": "711719541028"
    },
    "brand": "PlayStation",
    "model": "CFI-1015A",
    "sku": "381J1IR9OWLC",
    "upc": "711719541028",
    "rating": 4.6,
    "review_count": 6899,
    "availability": "OUT_OF_STOCK",
    "category": [
      {
        "name": "Video Games",
        "url": "/cp/video-games/2636"
      },
      {
        "name": "PlayStation",
        "url": "/cp/playstation/5170403"
      },
      {
        "name": "PlayStation 5",
        "url": "/cp/playstation-5/3475115"
      },
      {
        "name": "PlayStation 5 (PS5) Consoles",
        "url": "/cp/playstation-5-ps5-consoles/2762884"
      }
    ],
    "seller": "Walmart.com",
    "scraped_at": "2025-09-15 00:47:00",
    "reviews": [
      {
        "review_id": "255126182",
        "rating": 5,
        "title": "Next Gen gaming",
        "text": "Loving this console. Amazing and fluid. only problem I have is the stand. seems like an after thought but is a painful engineering flaw to me. totally disrupts the flow and look of the console. it's especially awkward when you first try to install it. not a big deal it's just surprising. Can't wait to see the slim model.",
        "author": "Mazdadriver88",
        "date": "3/13/2021",
        "helpful_count": 4,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "255971296",
        "rating": 5,
        "title": null,
        "text": "I decided I would try to get a ps5 after I failed at getting the series x and I happened to manage to get one. The videos for the ps5 dont quite show the power and features it has to offer. The best way to experience the power of this system is to see it in person. Amazing graphics and loading speed. I'm happy that I decided to get this system.",
        "author": "Jason",
        "date": "3/22/2021",
        "helpful_count": 3,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "242825560",
        "rating": 5,
        "title": "Really great console",
        "text": "Really solid console. I had an issue with my PlayStation shutting down due to an error with the external hard drive, and PlayStation support helped me solve it under five minutes. There’s a wide category of free ps4 games to play for free if you have PlayStation plus which is great to start out until games are starting to be released. There’s also a free ps5 game with plus already as well. The new UI is refreshing and the controller is much better than I thought it would be.",
        "author": null,
        "date": "11/13/2020",
        "helpful_count": 25,
        "not_helpful_count": 16,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "242819005",
        "rating": 4,
        "title": "So frustrated with website.",
        "text": "I have been on the website at all 3 launch times today, with a pc and my phone.   I have struggled with this website all the way through to the checkout process just to have the site lock up long enough for me to lose my product, every time. The website needs to be modified and beefed up to handle this kind of sale...  it is so maddening and frustrating.  I have had it in my cart 4 times just to have it spew error codes and pages in an endless nonsensical loop.",
        "author": "Lisa",
        "date": "11/13/2020",
        "helpful_count": 52,
        "not_helpful_count": 4,
        "verified_purchase": false,
        "photos": []
      },
      {
        "review_id": "243038430",
        "rating": 2,
        "title": "Reboots Galore",
        "text": "The PS5 will be an awesome console. I was able to play a few hours of fortnite and about an hour of Spider Man Miles Morales before my console rebooted and got the rebuilding database message for the first time. It has since rebooted 6 more times. I have not been able to play Cold War and have since uninstalled Cold War and Miles Morales. I haven't had any issues since. I of course did not spend $500  to play just fortnite. I know Sony is probably working on a patch right now, but it's still disappointing. If you have secured a console yet I wouldn't stress too much, the software is not stable at least for PS5 games in my theory.",
        "author": "Brett",
        "date": "11/14/2020",
        "helpful_count": 13,
        "not_helpful_count": 8,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "261656449",
        "rating": 2,
        "title": "Disc drive is not working right",
        "text": "Bought this for my husband and we got it within a week of ordering. He has only used it one day and when he went to put a disc in to play the disc drive sounded like it was a weedwacker/trimmer that you use outside to work on lawns. It was so loud. My husband and I tried multiple disc and it made that noise every time. After about 10 minutes or so it would stop but after some time it would start back up again. He had a disc in while he downloaded content for it and was playing a digital game and after about an hour playing the digital game the consoles drive started getting really loud again. We didn’t figured it was cause the disc was still in there downloading content, but all of a sudden the disc came flinging out of the console. I’m very mad about the fact that I’m paying over a $1,000 to Walmart for a console that was supposed to be brand new and it doesn’t even work right before we even get to use it. Now I’m probably going to have to call Sony and see if they will either fix it or replace it. There’s no point in having a disc version of a console when the console won’t even keep your games in it, and 90% of your games are on disc. Very disappointed and honestly don’t know how I feel about ever buying another console or video game system from Walmart again.",
        "author": "Terah",
        "date": "5/29/2021",
        "helpful_count": 6,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "244207319",
        "rating": 2,
        "title": "Add a better purchase system",
        "text": "This is probably a great console and deserves the hype but there really needs to be a system like captcha and like a small questioning on it so that the rate of bots drops significantly. I mean it’s be so bad I had it in my cart and even pressed place order and it even showed when it will arrive and it still denied me. I mean I don’t wanna end up with the only option being to buy from retailers that sell at triple the price",
        "author": "Aman",
        "date": "11/25/2020",
        "helpful_count": 4,
        "not_helpful_count": 0,
        "verified_purchase": false,
        "photos": []
      },
      {
        "review_id": "244257234",
        "rating": 1,
        "title": "Broken console with no way to exchange.",
        "text": "How about instead of selling more, you fix exchange the broken ones that some of us have received. Mine wont power on. The only way for me to fix in a timely fashion is to buy another one and return. Walmart says they dont have it to exchange, yet more keep going on sale. Complete garbage.",
        "author": "Justin",
        "date": "11/26/2020",
        "helpful_count": 81,
        "not_helpful_count": 60,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "258956284",
        "rating": 1,
        "title": "1 month 2 days and 12 city's later. PS5 Journey",
        "text": "The console it self is awesome. However I bought this march 18th 2021 it came April 20th 2021 the shipping box was not taped straight from Walmart and my PS5 box has a huge rip in the front of it. Shipping Bad costumer service was also bad no one could give me any information on where my order was. It also went through 12 different city's before getting to me. Would not recommend buying PS5 from walmart.com",
        "author": "Traci",
        "date": "4/25/2021",
        "helpful_count": 8,
        "not_helpful_count": 4,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "267690365",
        "rating": 1,
        "title": null,
        "text": "Ordering this from walmart was a very hard task, from the beginning to the end, when i can finally get it, it comes broken, the box has a damage in one of the corners, and when i open it,  also the console, talk to customer service and the only solution they gave me was a refund. Very disappointing.",
        "author": "Amina",
        "date": "8/17/2021",
        "helpful_count": 4,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      }
    ],
    "total_reviews": 10,
    "review_summary": {
      "average_rating": 4.6,
      "total_count": 6899,
      "rating_distribution": {
        "1": 3,
        "2": 3,
        "3": 0,
        "4": 1,
        "5": 3
      }
    }
  }
]