[
  {
    "url": "https://www.walmart.com/ip/Apple-iPhone-14-128GB-Blue-Verizon/1736740710",
    "title": "Sony PlayStation 5 Video Game Console",
    "description": "The PS5™ console unleashes new gaming possibilities that you never anticipated. Experience lightning fast loading with an ultra-high speed SSD, deeper immersion with support for haptic feedback, adaptive triggers, and 3D Audio*, and an all-new generation of incredible PlayStation® games.",
    "price": {
      "current": 499,
      "currency": "USD",
      "display": "$499.00",
      "was_price": null,
      "savings": null
    },
    "images": [
      "https://i5.walmartimages.com/seo/Sony-PlayStation-5-Video-Game-Console_9333b8cd-773e-49d4-8e85-51c4114fcd56.bbf5c4e4f3746ddc28ac982117cdbf9a.jpeg",
      "https://i5.walmartimages.com/asr/985f6fea-1255-44f9-a4b1-d26e62ebc6f9.08c17391d3df289f6842e270f7180eec.jpeg",
      "https://i5.walmartimages.com/asr/69c08bf8-207b-4669-81f2-acfa950c4a94.d51028ed9404147f4050401047a6279f.jpeg",
      "https://i5.walmartimages.com/asr/b3a883cc-c414-4818-a687-de74d04f5349.ad369bba070eb7d13a262d55b1a3980d.jpeg"
    ],
    "specifications": {
      "Brand": "PlayStation",
      "Model": "CFI-1215A01X",
      "UPC": "711719556169"
    },
    "brand": "PlayStation",
    "model": "CFI-1215A01X",
    "sku": "4S6KN6TWU0A0",
    "upc": "711719556169",
    "rating": 4.8,
    "review_count": 4499,
    "availability": "OUT_OF_STOCK",
    "category": [
      {
        "name": "Video Games",
        "url": "/cp/video-games/2636"
      },
      {
        "name": "PlayStation",
        "url": "/cp/playstation/5170403"
      },
      {
        "name": "PlayStation 5",
        "url": "/cp/playstation-5/3475115"
      },
      {
        "name": "PlayStation 5 (PS5) Consoles",
        "url": "/cp/playstation-5-ps5-consoles/2762884"
      }
    ],
    "seller": "Walmart.com",
    "scraped_at": "2025-09-15 01:21:39",
    "reviews": [
      {
        "review_id": "396282776",
        "rating": 5,
        "title": null,
        "text": "cam in a timely manner my son love it the only rging i would suggest is the box the playstation 5 comes in they should have something to let people know the other end of the box opens and thats where the cords and controller is located we thought they forgot to put the accessories.",
        "author": "Teresa",
        "date": "8/24/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "300369795",
        "rating": 5,
        "title": "Love my ps5!",
        "text": "After waiting years of it being out of stock I finally got mine with my Tax return. The console itself is large but yet its light, threw me off but it works so well as I expected. I have being playing playstion snice PS1 so this was definitely a great buy and I al ready to see what games are coming in the future!!!!!",
        "author": "Aerogoth",
        "date": "2/12/2023",
        "helpful_count": 26,
        "not_helpful_count": 4,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "301666329",
        "rating": 5,
        "title": "Absolutely love it 😍😍😍",
        "text": "I have owned and loved every PlayStation since the PS1. I ordered this on February 17 2023 with a copy of the Dead Space remake and I absolutely love it. It comes with a game called Astro's Playroom pre-installed which is great because it shows you all the stuuf the DualSense 5 controller can do. It's also just a fun game to play to pass the time. You could easily spend a couple of hours at a time playing Astro's Playroom. I highly recommend buying the PS5 disc edition.",
        "author": "Chris",
        "date": "3/3/2023",
        "helpful_count": 14,
        "not_helpful_count": 1,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "300523008",
        "rating": 5,
        "title": "Ps5 Disc Edition",
        "text": "Im so happy with my ps5. After the release of Hogwarts Legacy, I just couldn’t wait any longer to get my ps5. I was able to get one shipped and sold by Walmart directly while they were in stock for $499. I paired my purchase with a starlight blue cover and matching controller. I couldn’t be happier, especially because the scalpers didn’t get my money. The ps5 itself is in perfect condition. Box undamaged and unopened. Extremely happy to finally got my hands on one.",
        "author": "Kyle",
        "date": "2/15/2023",
        "helpful_count": 13,
        "not_helpful_count": 2,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "296013686",
        "rating": 5,
        "title": "PlayStation did it again! Two thumbs up!",
        "text": "The PS5 is awesome! I have had a ps4 for over 4 years and it was time to upgrade. And we’ll it’s totally worth it. Graphics are amazing, the speed on the console is crazy!",
        "author": "JohnPaul",
        "date": "12/20/2022",
        "helpful_count": 10,
        "not_helpful_count": 3,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "294198020",
        "rating": 4,
        "title": "Happy I finally got one, but....",
        "text": "I was just happy that after 2 years i was able to get one, but the fact that money was taken out only to be returned and then taken out again once the item shipped was unappreciated, if the money was taken out just keep it! no need to \"test to see if the payment system worked\" you already had the money once I ordered it, keep it!",
        "author": "Mae",
        "date": "12/4/2022",
        "helpful_count": 2,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "292262228",
        "rating": 3,
        "title": "Roll the Dice With the Swiss Cheese Box",
        "text": "The box that Walmart ships the PS5 in is absolutely asinine. It has 2 decent size cutouts over the barcodes, which are literal holes in the shipping box itself. These holes expose nearby wording which identify the contents as a PlayStation. Luckily, mine was not stolen, but I was also home to receive it. \n\nFurthermore, either my courier thought the holes made great handles or the holes allowed the package to become snagged on something. Either way, not only was the shipping box torn open, but this also completely ripped up the bottom of the PS5 packaging.\n\nI've never made a stink before, no matter how poor the packaging. However, when I spend $550 on a single item, I expect it to arrive protected....or, at the very least, in a box with all its sides. It's just common sense.",
        "author": "Brandy",
        "date": "11/18/2022",
        "helpful_count": 10,
        "not_helpful_count": 3,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "292944678",
        "rating": 1,
        "title": "Where is PlayStation?!",
        "text": "Well I was suppose to receive this by November 15th, here it is November 24th and no PS5! When I look at the tracking of it all it says is placed! I call Walmart and they tell me to cancel it and buy another one! Are you serious?! So I have to pay atleast $60 more?! I want the PS5 that I originally bought! My mother gave me money toward this on October 16th, she passed on October 18th very unexpectedly. This PlayStation means a lot to my son, plus he works at Walmart! I can't believe I'm have this goose chase like this when I should be mourning my mother, not worried about if my son is going to get his PlayStation or not! I'll gladly change my review when I get the console!",
        "author": "Krystal",
        "date": "11/24/2022",
        "helpful_count": 13,
        "not_helpful_count": 9,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "355537338",
        "rating": 1,
        "title": "Never got package",
        "text": "Zero stars!!! Never received package!!! Still waiting for UPS to finish investigating what happened to it, Walmart was no help at all, if u want a ps5 get it in store don't buy online!!! Walmart will just rip u off!!!",
        "author": "Aj",
        "date": "8/28/2024",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "290864469",
        "rating": 1,
        "title": "AWFUL AWFUL AWFUL",
        "text": "Your delivery was way late. The box was so damaged that I was worried that it my PS5 was going to be broken. And no it was not due to shipping. It was inside the shipping box. The damage occurred before the unit was placed in the shipping box as the shipping box was undamaged. I will never ever order from Walmart again!",
        "author": "Chris",
        "date": "11/8/2022",
        "helpful_count": 7,
        "not_helpful_count": 5,
        "verified_purchase": true,
        "photos": []
      }
    ],
    "total_reviews": 10,
    "review_summary": {
      "average_rating": 4.8,
      "total_count": 4499,
      "rating_distribution": {
        "1": 3,
        "2": 0,
        "3": 1,
        "4": 1,
        "5": 5
      }
    }
  },
  {
    "url": "https://www.walmart.com/ip/Sony-PlayStation-5-PS5-Video-Game-Console/363472942",
    "title": "PlayStation 5 Console",
    "description": "Play has no limits with the PlayStation 5 Console. The PS5 console unleashes new gaming possibilities that you never anticipated. Experience lightning fast loading with an ultra-high speed SSD, deeper immersion with support for haptic feedback, adaptive triggers, and 3D Audio, and an all-new generation of incredible PlayStation games. Harness the power of a custom CPU, GPU, and SSD with Integrated I/O that rewrite the rules of what a PlayStation console can do. Marvel at incredible graphics and experience new PS5 features. Discover a deeper gaming experience with support for haptic feedback, adaptive triggers, and 3D Audio technology. Maximize your play sessions with near-instant load times for PS5 games. And the custom integration of the PS5 console's systems lets creators pull data from the SSD so quickly that they can design games in ways never before possible. Play has no limits with the PlayStation 5 Console.",
    "price": {
      "current": 499,
      "currency": "USD",
      "display": "$499.00",
      "was_price": null,
      "savings": null
    },
    "images": [
      "https://i5.walmartimages.com/seo/PlayStation-5-Console_b29e7500-cac2-4d1f-b4aa-5e0ebb3de124.c0b04249d968e2c1e5d25799b96ee0e3.jpeg",
      "https://i5.walmartimages.com/asr/4e7deb33-3a02-4ec2-9fda-a07ea139f600.946f9cdaef0a37afef8dc18fa74288f1.jpeg"
    ],
    "specifications": {
      "Brand": "PlayStation",
      "Model": "CFI-1015A",
      "UPC": "711719541028"
    },
    "brand": "PlayStation",
    "model": "CFI-1015A",
    "sku": "381J1IR9OWLC",
    "upc": "711719541028",
    "rating": 4.6,
    "review_count": 6899,
    "availability": "OUT_OF_STOCK",
    "category": [
      {
        "name": "Video Games",
        "url": "/cp/video-games/2636"
      },
      {
        "name": "PlayStation",
        "url": "/cp/playstation/5170403"
      },
      {
        "name": "PlayStation 5",
        "url": "/cp/playstation-5/3475115"
      },
      {
        "name": "PlayStation 5 (PS5) Consoles",
        "url": "/cp/playstation-5-ps5-consoles/2762884"
      }
    ],
    "seller": "Walmart.com",
    "scraped_at": "2025-09-15 01:22:26",
    "reviews": [
      {
        "review_id": "255126182",
        "rating": 5,
        "title": "Next Gen gaming",
        "text": "Loving this console. Amazing and fluid. only problem I have is the stand. seems like an after thought but is a painful engineering flaw to me. totally disrupts the flow and look of the console. it's especially awkward when you first try to install it. not a big deal it's just surprising. Can't wait to see the slim model.",
        "author": "Mazdadriver88",
        "date": "3/13/2021",
        "helpful_count": 4,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "255971296",
        "rating": 5,
        "title": null,
        "text": "I decided I would try to get a ps5 after I failed at getting the series x and I happened to manage to get one. The videos for the ps5 dont quite show the power and features it has to offer. The best way to experience the power of this system is to see it in person. Amazing graphics and loading speed. I'm happy that I decided to get this system.",
        "author": "Jason",
        "date": "3/22/2021",
        "helpful_count": 3,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "242825560",
        "rating": 5,
        "title": "Really great console",
        "text": "Really solid console. I had an issue with my PlayStation shutting down due to an error with the external hard drive, and PlayStation support helped me solve it under five minutes. There’s a wide category of free ps4 games to play for free if you have PlayStation plus which is great to start out until games are starting to be released. There’s also a free ps5 game with plus already as well. The new UI is refreshing and the controller is much better than I thought it would be.",
        "author": null,
        "date": "11/13/2020",
        "helpful_count": 25,
        "not_helpful_count": 16,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "242819005",
        "rating": 4,
        "title": "So frustrated with website.",
        "text": "I have been on the website at all 3 launch times today, with a pc and my phone.   I have struggled with this website all the way through to the checkout process just to have the site lock up long enough for me to lose my product, every time. The website needs to be modified and beefed up to handle this kind of sale...  it is so maddening and frustrating.  I have had it in my cart 4 times just to have it spew error codes and pages in an endless nonsensical loop.",
        "author": "Lisa",
        "date": "11/13/2020",
        "helpful_count": 52,
        "not_helpful_count": 4,
        "verified_purchase": false,
        "photos": []
      },
      {
        "review_id": "243038430",
        "rating": 2,
        "title": "Reboots Galore",
        "text": "The PS5 will be an awesome console. I was able to play a few hours of fortnite and about an hour of Spider Man Miles Morales before my console rebooted and got the rebuilding database message for the first time. It has since rebooted 6 more times. I have not been able to play Cold War and have since uninstalled Cold War and Miles Morales. I haven't had any issues since. I of course did not spend $500  to play just fortnite. I know Sony is probably working on a patch right now, but it's still disappointing. If you have secured a console yet I wouldn't stress too much, the software is not stable at least for PS5 games in my theory.",
        "author": "Brett",
        "date": "11/14/2020",
        "helpful_count": 13,
        "not_helpful_count": 8,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "261656449",
        "rating": 2,
        "title": "Disc drive is not working right",
        "text": "Bought this for my husband and we got it within a week of ordering. He has only used it one day and when he went to put a disc in to play the disc drive sounded like it was a weedwacker/trimmer that you use outside to work on lawns. It was so loud. My husband and I tried multiple disc and it made that noise every time. After about 10 minutes or so it would stop but after some time it would start back up again. He had a disc in while he downloaded content for it and was playing a digital game and after about an hour playing the digital game the consoles drive started getting really loud again. We didn’t figured it was cause the disc was still in there downloading content, but all of a sudden the disc came flinging out of the console. I’m very mad about the fact that I’m paying over a $1,000 to Walmart for a console that was supposed to be brand new and it doesn’t even work right before we even get to use it. Now I’m probably going to have to call Sony and see if they will either fix it or replace it. There’s no point in having a disc version of a console when the console won’t even keep your games in it, and 90% of your games are on disc. Very disappointed and honestly don’t know how I feel about ever buying another console or video game system from Walmart again.",
        "author": "Terah",
        "date": "5/29/2021",
        "helpful_count": 6,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "244207319",
        "rating": 2,
        "title": "Add a better purchase system",
        "text": "This is probably a great console and deserves the hype but there really needs to be a system like captcha and like a small questioning on it so that the rate of bots drops significantly. I mean it’s be so bad I had it in my cart and even pressed place order and it even showed when it will arrive and it still denied me. I mean I don’t wanna end up with the only option being to buy from retailers that sell at triple the price",
        "author": "Aman",
        "date": "11/25/2020",
        "helpful_count": 4,
        "not_helpful_count": 0,
        "verified_purchase": false,
        "photos": []
      },
      {
        "review_id": "244257234",
        "rating": 1,
        "title": "Broken console with no way to exchange.",
        "text": "How about instead of selling more, you fix exchange the broken ones that some of us have received. Mine wont power on. The only way for me to fix in a timely fashion is to buy another one and return. Walmart says they dont have it to exchange, yet more keep going on sale. Complete garbage.",
        "author": "Justin",
        "date": "11/26/2020",
        "helpful_count": 81,
        "not_helpful_count": 60,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "258956284",
        "rating": 1,
        "title": "1 month 2 days and 12 city's later. PS5 Journey",
        "text": "The console it self is awesome. However I bought this march 18th 2021 it came April 20th 2021 the shipping box was not taped straight from Walmart and my PS5 box has a huge rip in the front of it. Shipping Bad costumer service was also bad no one could give me any information on where my order was. It also went through 12 different city's before getting to me. Would not recommend buying PS5 from walmart.com",
        "author": "Traci",
        "date": "4/25/2021",
        "helpful_count": 8,
        "not_helpful_count": 4,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "267690365",
        "rating": 1,
        "title": null,
        "text": "Ordering this from walmart was a very hard task, from the beginning to the end, when i can finally get it, it comes broken, the box has a damage in one of the corners, and when i open it,  also the console, talk to customer service and the only solution they gave me was a refund. Very disappointing.",
        "author": "Amina",
        "date": "8/17/2021",
        "helpful_count": 4,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      }
    ],
    "total_reviews": 10,
    "review_summary": {
      "average_rating": 4.6,
      "total_count": 6899,
      "rating_distribution": {
        "1": 3,
        "2": 3,
        "3": 0,
        "4": 1,
        "5": 3
      }
    }
  },
  {
    "url": "https://www.walmart.com/ip/Philergo-Nugget-Ice-Maker-Countertop-Pebble-Ice-Maker-Machine-Self-Cleaning-35lbs-24hr-Soft-Chewable-Pellet-Ice-Maker-Home-Kitchen-Stainless-Steel/6040950294?classType=REGULAR",
    "title": "Philergo Nugget Ice Maker Countertop, Pebble Ice Maker Machine with Self-Cleaning, 35lbs/24hr, Soft Chewable Pellet Ice Maker for Home, Kitchen, Stainless Steel",
    "description": "<p>Philergo is a premier home appliance brand dedicated to ringing innovative, high-performance products with superior design to consumers worldwide. This nugget ice maker countertop would be you first choice withe below outstanding feature, 6-10 mintues will be producted enough soft, chewable ice, with up to 35lbs/24hrs &nbsp;for your family, party. The colorful led indicator will show the portable ice maker machine what does it situation now. with size of 12.67\" x 8.66\" x 11.29\", it fits on any countertop for your kitchen.The crunchy crush ice, Making great iced tea, coffee, or cocktails. Even chill beers and keep food fresh.??</p>\n<p>🧊<b>Specification:</b></p>\n<p>Brand: Philergo</p><p>\n</p><p>Voltage: 115 Volts</p><p>\n</p><p>Energy Efficient: 1Kwh/8H</p><p>\n</p><p>Low Noise: &lt;45db</p><p>\n</p><p>Daily Output: 35lbs</p><p>\n</p><p>Material: Stainless Steel</p><p>\n</p><p>Water Tank Capacity: 1.2L</p><p>\n</p><p>Ice Basket Capacity: 1.8lbs</p><p>\n</p><p>Ice Type: Nugget Ice; Pebble Ice; Pellet Ice</p><p>\n</p><p>Product Weight: 20.8lbs</p><p>\n</p><p>Product Dimensions: 11.29\"D x 8.66\"W x 12.67\"H</p><p>\n</p><p>Feature: One Button, Led Indicator, Self-Cleaning, Smart Indicator Alert<br><br>🧊<b>Key Feature:</b></p>\n<ul><li>Intuitive &amp; Simple Controls: Our Philergo&nbsp;nugget ice maker countertop is designed with user-friendly concepts, just \"ONE\" button, everything will be control. Colorful Led indicator let you know what status is, white for Making, green for\n        ice be full, blue for self washing, red for water empty.</li></ul>\n<ul><li>Fash &amp; Effective Ice-Making: Philergo pebble ice maker produces soft chewable ice in just 6-10 minutes. with 1.2L water tank, providing you with about 35 pounds of pebble ice within 24 hours, is about 50 cups (8.5 fl oz) full of nugget ice. Ensuring\n        a steady supply of fresh pellet ice for your household or party. No need to go to the store for ice anymore!</li></ul>\n<ul><li>Nicer Nugget Ice: Philergo Pebble ice maker provides you with crunchy ice. These chewable nugget ice has a more softer texture and a larger surface area, which makes drinks cool faster, but melts slowly. Whatever the cocktails, sodas, beers, or any\n        drinks, even the food, our nugget ice will be your first choice.</li></ul>\n<ul><li>Hassle-Free Cleaning: The built-in self-cleaning mode takes care of routine maintenance, while a detachable top allows easy access for deep cleaning when you needed. Spend less time cleaning and more time enjoying your ice!</li></ul>\n<ul><li>Compact &amp; Portable Design: Our pebble ice machine has compact dimensions of 12.67 x&nbsp;8.66 x 11.29 inches. Fits on most countertops and ideal for home, kitchen, RV. Take it and enjoy the ice!</li></ul>\n<ul><li>Buy with Confidence: Our Philergo nugget ice makers provide you with a one-year warranty service. If our pebble ice maker meet any issues, do not hesitate, please contact us, we will give you reliable and satisfied support.<br></li></ul>\n<p>🧊<b>Package Included:</b></p>\n<p>1 x Nugget Ice Maker</p>\n<p>1 x Ice Scooper</p>\n<p>1 x Ice Basket</p>\n<p>1 x Water Tank</p>\n<p>🧊<b>NOTE:</b></p>\n<p>IF THE ICE MAKER YOU GOT IS BLUE/GREEN, THAT'S THE PROTECTIVE FILM. You can tear it out or keep it.</p>",
    "price": {
      "current": 149.99,
      "currency": "USD",
      "display": "$149.99",
      "was_price": 299.99,
      "savings": null
    },
    "images": [
      "https://i5.walmartimages.com/seo/Philergo-Nugget-Ice-Maker-Countertop-Pebble-Ice-Maker-Machine-Self-Cleaning-35lbs-24hr-Soft-Chewable-Pellet-Ice-Maker-Home-Kitchen-Stainless-Steel_79ec8f16-38b3-46a0-b9a9-e6e63a631113.2475ac3109094bc3252c26cd13bbb18a.jpeg",
      "https://i5.walmartimages.com/asr/24e668df-2765-405a-b5ff-85b69fd72aea.c0063404a1956361bee2379610d597e7.png",
      "https://i5.walmartimages.com/asr/9d5ed61a-50c8-46fd-8a60-8d24d845283b.fbfbcbde9b5837d5349eaf6ddea4a7c3.png",
      "https://i5.walmartimages.com/asr/438a09a3-b3e1-4500-a650-1b25df10304f.2d05db6c214fc2e7e72ef5e8386804a6.png",
      "https://i5.walmartimages.com/asr/88baa360-aea1-4213-aa09-8b724afb94bc.b614b9d3484cd7f85f48b25d875e01e3.png",
      "https://i5.walmartimages.com/asr/b82085d5-5c24-4c90-a556-2f81b6bfe8c5.3d988755b903120c801615144f4b82a3.jpeg",
      "https://i5.walmartimages.com/asr/8b9f6f88-a557-4dd6-b195-3c912d0244c0.3ee59b9a6c4b1bf4f94049a57f26912a.png",
      "https://i5.walmartimages.com/asr/676dbf20-d951-4d61-bde5-52d0a888c6a4.96900c26517af18b35d21e3ddebc4187.png",
      "https://i5.walmartimages.com/asr/38672313-e78e-440a-b026-7716bb43b3f1.898234b86e1690f7d6076d399e795d79.png",
      "https://i5.walmartimages.com/asr/129ccad0-2382-475e-8c90-b1443df33395.cd27b98f742d2e3c2381fd72dcd78b5e.jpeg"
    ],
    "specifications": {
      "Brand": "Philergo",
      "Model": "IceMaker36T",
      "UPC": "810110437364"
    },
    "brand": "Philergo",
    "model": "IceMaker36T",
    "sku": "5LS5YG4AT8DF",
    "upc": "810110437364",
    "rating": 4.3,
    "review_count": 596,
    "availability": "IN_STOCK",
    "category": [
      {
        "name": "Home",
        "url": "/cp/home/4044"
      },
      {
        "name": "Appliances",
        "url": "/cp/appliances/90548"
      },
      {
        "name": "Freezers",
        "url": "/cp/freezers/6828819"
      },
      {
        "name": "Ice Makers",
        "url": "/cp/ice-makers/4192417"
      },
      {
        "name": "Countertop Ice Makers",
        "url": "/cp/countertop-ice-makers/9372690"
      }
    ],
    "seller": "Giada Ergonomic Furniture Co., Ltd",
    "scraped_at": "2025-09-15 01:25:31",
    "reviews": [
      {
        "review_id": "393487439",
        "rating": 5,
        "title": "great purchase",
        "text": "love the size of the ice and the amount that is produced. will take a bit to have enough ice for drinks but if you run it all day and bag the ice periodically you can accumulate a nice amount in a short period of time.   we use a lot of ice and love it.",
        "author": "Michelle",
        "date": "7/27/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "387493393",
        "rating": 5,
        "title": "Great nugget Ice maker",
        "text": "This ice maker has exceeded my expectations. I didn't want to spend the money on a nugget ice maker. After my 3rd bullet ice maker I was searching for an affordable nugget one. The basket holds a good amount of ice and per the instruction the chute does need to be cleared by redistributing the ice,  if you want more ice to be made. I use it several times a day so it is not a problem for me.  I use RO water but still have used the cleaning mode, which I like as my bullet ones didn't have this feature. This was actually half price and so far it has been great. The picture still shows the protective film that I have yet to remove.",
        "author": "Krystal",
        "date": "6/2/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "391378820",
        "rating": 5,
        "title": "so far, so good!",
        "text": "This is my second icemaker. The 1st one lasted almost 2 years, just 1 week shy of the extended warranty plan's expiration date. That almost never happens. I got lucky.\n\nThis one is better: I like the visible ice basket so I  don't have to open the lid to see the amount of ice. It has a suction cup to hang the scoop. It is faster at making ice. It's prettier. The ice falls from the center, so it doesn't seem to think it's full as fast as the one that filled from the side.\nI know most machines are made by the same company but with different features and the same short life spans, usually 1 to 2 years. Always get the extended warranty on items like this. \n\nI got this one for $25  less than on Amazon and the 3 year Allstate plan for less than 1/2 the price of 2 year Asurion plan. Win! \n\n I had really wanted a Smart ice maker this time, but I found with my 1st machine that using a Switchbot made setting a timer much cheaper, and it's Google Home Compatible. \n\nClean regularly to make it last, esp with hard water. 5 to 1 water/vinegar.  I just started using descaling tablets or liquid to make this one last longer. Use filtered, spring, or distilled water if possible. \nTake the top off the machine to check for mold or scale every month, or if you see any specks in the water. \nEnjoy your clean Sonic ice!",
        "author": "Cady",
        "date": "7/10/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "395557338",
        "rating": 5,
        "title": "Good Ice",
        "text": "The icemaker produces really good ice. It is has only one problem and that problem is that it randomly turns off and we have yet to figure out why but for the most part it usually just always is producing ice. It doesn't produce a lot, but yeah, it's good.",
        "author": "Robert",
        "date": "8/16/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "392683780",
        "rating": 5,
        "title": "Great Nugget Ice Maker",
        "text": "This seems like such a great buy for the price.  Since I have only had it for a week we will wait and see   I Love  the soft nuggets, must nugget ice makers  are so expensive.   I will review again after I have had it for awhile. Right now I highly recommend giving it a try great price and seems like a great little ice maker",
        "author": "Cindy",
        "date": "7/19/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "393656050",
        "rating": 5,
        "title": "Definitely a good purchase",
        "text": "The only thing I would do differently is make the ice tray hold the cold ice. You have to transfer the ice into a ziplock bag or something of the sort to store it in freezer. Keep something close to break up the ice. Other than that it makes perfect bite size ice! I like it! I use bottle water not our well water just to save the machine.",
        "author": "Shaylean",
        "date": "7/29/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "391204234",
        "rating": 4,
        "title": "Good ice maker but it's loud,",
        "text": "I like that it makes the ice fairly quickly . but the machine is loud . I've had other ice makers in the past and they were way quieter than this. If you're home tends to be generally quiet on a regular basis this is going to be louder your refrigerator running in the background or a washing machine or a clothing dryer . it's definitely going to be louder than a dishwasher . if you're expecting to get this machine and expect it to be quiet this is not the machine for you",
        "author": "anonymous",
        "date": "7/8/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "389667812",
        "rating": 4,
        "title": null,
        "text": "It serves the purpose although it never fills up the bin entirely because the extraction port gets blocked by the ice so you have to move it around for it to continue to fill the bin. Plus the cooling of the interior is lacking which results in the ice melting back into the water bin",
        "author": "Tom",
        "date": "6/24/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "390939861",
        "rating": 3,
        "title": "Bad design",
        "text": "The only bad thing about this machine is the ice stacks up against the back wall where the ice is coming out and it thinks it's full so it stops making ice so the bucket never fills up unless you keep an eye on it and knock the ice down which is about every 30 minutes or so.  Disappointed with it.",
        "author": "Rita",
        "date": "7/6/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "395484352",
        "rating": 3,
        "title": "poor ice tray design",
        "text": "the ice does spread out and fill up the container. the ice dispensing shoot is narrow which stacks up the ice which stops the machine after 9 oz of ice is produced. Other counter size nugget ice machines spread out the ice allowing it to fill up the entire container before stopping.",
        "author": "Robert",
        "date": "8/16/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      }
    ],
    "total_reviews": 10,
    "review_summary": {
      "average_rating": 4.3,
      "total_count": 596,
      "rating_distribution": {
        "1": 0,
        "2": 0,
        "3": 2,
        "4": 2,
        "5": 6
      }
    }
  },
  {
    "url": "https://www.walmart.com/ip/seort/14590271671",
    "title": "Blossom Essentials Total Moisture Body Wash, 8 fl oz",
    "description": "BEAUTYSPACE Blossom Essentials Total Moisture Body Wash, 8 fl oz. A gentle, soothing body wash designed to support your skin's natural moisture barrier, keeping you hydrated and nourished with every wash.",
    "price": {
      "current": 19,
      "currency": "USD",
      "display": "$19.00",
      "was_price": null,
      "savings": null
    },
    "images": [
      "https://i5.walmartimages.com/seo/Blossom-Essentials-Total-Moisture-Body-Wash-8-fl-oz_d5ca25a4-062b-4a49-9c90-4d3bbf2515cb.9b7c9b9cdc402771619a3a830b0b4796.png",
      "https://i5.walmartimages.com/asr/a13768d2-f799-4a6b-8b43-286a9a3a9e73.baf3eeb304abaab1ffffc2b68cd33834.jpeg",
      "https://i5.walmartimages.com/asr/491586aa-67ba-4375-8bb5-5355771482b4.4ce9c5d253f1fcdfd54118f70b3ff17a.jpeg",
      "https://i5.walmartimages.com/asr/50ff114d-f129-4cd0-a22e-8d70582a0f3c.b3c638f64089bf3f647478b910a1f3b0.jpeg",
      "https://i5.walmartimages.com/asr/573293a6-ae30-479d-879f-42f565c33475.2494f74fedb28f672d69db5bb5d79b0a.jpeg",
      "https://i5.walmartimages.com/asr/049ea6c0-c959-4892-89b2-9b053547571c.4cf2c567dec53eabea7c12ebf5a07dd0.jpeg"
    ],
    "specifications": {
      "Brand": "Blossom Essentials",
      "Model": "003-101-080",
      "UPC": "860006171766"
    },
    "brand": "Blossom Essentials",
    "model": "003-101-080",
    "sku": "1A8TL100QIIW",
    "upc": "860006171766",
    "rating": 4.7,
    "review_count": 35,
    "availability": "IN_STOCK",
    "category": [
      {
        "name": "Personal Care",
        "url": "/cp/personal-care/1005862"
      },
      {
        "name": "Bath & Body",
        "url": "/cp/bath-body/1071969"
      },
      {
        "name": "Body Wash",
        "url": "/cp/body-wash/1074364"
      },
      {
        "name": "All Body Wash",
        "url": "/cp/all-body-wash/2482671"
      }
    ],
    "seller": "Walmart.com",
    "scraped_at": "2025-09-15 01:31:28",
    "reviews": [],
    "total_reviews": 0,
    "review_summary": {
      "average_rating": 4.7,
      "total_count": 35,
      "rating_distribution": {
        "1": 0,
        "2": 0,
        "3": 0,
        "4": 0,
        "5": 0
      }
    }
  },
  {
    "url": "https://www.walmart.com/ip/290404627",
    "title": "Costway 4-in-1 Baby Walker Foldable Activity Push Walker Adjustable Height Blue",
    "description": "With the simulated racing car shape, the baby walker will be more attractive to kids than others. And the appealing sound and light effect offers more fun to your little one. More importantly, the 4-in-1 versatile design with adjustable height and speed enables the walker to grow with your baby. This baby walker is also quite safe to use, as it’s designed with anti-slip base and safety bumper. Furthermore, with quick-folding design, the walker won’t take up too much space for storage. <br><br><br><br>Feature<br>4-in-1 multifunctional design meets different demands of baby<br>\n3-level adjustable heights (20”/21”/22”) for babies of different heights<br>\nErgonomic and padded seat for high-level comfort<br>\nSeat cushion is detachable and washable<br>\nSafe to use with back bumper and anti-slip base<br>\nSteering wheel and music box provide more fun<br>\nFoldable design for space-saving storage<br><br><br><br>Specification<br>Color: Blue <br>\nMaterial: PP, Polyester, Sponge<br>\nDimension of Unfolding: 29'' x 24'' x 20''/21''/22'' (L x W x H) <br>\nDimension of Folding: 29'' x 24'' x 11'' (L x W x H) <br>\nNet Weight: 10 lbs<br>\nWeight Capacity: 25 lbs<br>\nRecommended Age: 6 – 18 Months<br>\nBattery: 2 AA Batteries (Not Included) <br>\nPackage Includes: <br>\n1 x Baby Walker<br>\n1 x Instruction<br>",
    "price": {
      "current": 72.79,
      "currency": "USD",
      "display": "$72.79",
      "was_price": 129,
      "savings": null
    },
    "images": [
      "https://i5.walmartimages.com/seo/Costway-4-in-1-Baby-Walker-Foldable-Activity-Push-Walker-Adjustable-Height-Blue_be340dc0-a414-4042-a188-ef19cbef33c6.ef744041ebe2d66a2f51a02480879aba.jpeg",
      "https://i5.walmartimages.com/asr/28c312c5-a3a8-41ab-a25f-cd0f4436c732.1de2a3bf9fa1b329fffd610fd45deadd.jpeg",
      "https://i5.walmartimages.com/asr/ec4c7d31-8d45-4eda-ab69-e1bcb1a3f995.160ecf238c076c51971fac749b7795db.jpeg",
      "https://i5.walmartimages.com/asr/487a50f3-460a-4721-bef8-57a60fcf2368.ed4d500a012780847b58ae7f6ac91362.jpeg",
      "https://i5.walmartimages.com/asr/edc3d75d-96d6-4c3b-9462-15923e517b25.65d6c555c39dd99938515dee03722233.jpeg",
      "https://i5.walmartimages.com/asr/64856284-c79f-4dba-bdba-e70af6ce6c30.756c149fd79fde5d25b84c2d5385ef73.jpeg",
      "https://i5.walmartimages.com/asr/12fcbca8-cccb-4a63-a88e-3b74c3136dcb.8193147cfe04632798098c08ff2d7d25.jpeg",
      "https://i5.walmartimages.com/asr/703d2ea8-7234-4f33-b6df-f47377d5320b.4d8d1278966328678fc74a0000814b8f.jpeg"
    ],
    "specifications": {
      "Brand": "Costway",
      "Model": "2137C"
    },
    "brand": "Costway",
    "model": "2137C",
    "sku": "5013DOQXTVFM",
    "upc": null,
    "rating": 4.6,
    "review_count": 305,
    "availability": "IN_STOCK",
    "category": [
      {
        "name": "Baby",
        "url": "/cp/baby/5427"
      },
      {
        "name": "Baby Activities & Gear",
        "url": "/cp/baby-activities-gear/86323"
      },
      {
        "name": "Baby Walkers",
        "url": "/cp/baby-walkers/1231322"
      }
    ],
    "seller": "Goplus Corp",
    "scraped_at": "2025-09-15 01:32:22",
    "reviews": [
      {
        "review_id": "382554816",
        "rating": 5,
        "title": "Race car everyone likes",
        "text": "Bought it for my kid. It's a big hit when there were few other kids as well at the home. Everyone wanted to sit in a race car. Luckily this had adjustable height, so everyone could sit. Will dismantle it and keep it for playing soon.",
        "author": "anonymous",
        "date": "4/19/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "371747547",
        "rating": 5,
        "title": "A Great Walker",
        "text": "My great granson loves it! His dad said it was easy to put together and he fits right in. He's only 6 months old, but he sits up like a big boy in it. They sent me a picture and he's all smiles from ear to ear.",
        "author": "Mary",
        "date": "1/11/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "394229614",
        "rating": 5,
        "title": "4 in 1 walker",
        "text": "Love it and the baby loves it also the lights everything",
        "author": "shontia",
        "date": "8/3/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "397450423",
        "rating": 5,
        "title": null,
        "text": "My grandson loves this - he lost his mind when we tried to take him out of it lol.\nVery well built",
        "author": "MARY",
        "date": "9/4/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "398029128",
        "rating": 5,
        "title": null,
        "text": "The baby loves his walker thank you very much",
        "author": "Ice",
        "date": "9/10/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "371737039",
        "rating": 5,
        "title": null,
        "text": "our baby is just trying to move it a little.  it is too early to tell.  it seems bulky to move around at this stage.",
        "author": "Satisfied",
        "date": "1/11/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "369070935",
        "rating": 5,
        "title": "Rad Rad Rad",
        "text": "Anyone who is looking for one of these, stop right after you read this I come from a family of 12 kids and this one piece of work you'll love future drag racer look out Max",
        "author": "debra",
        "date": "12/24/2024",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "392659790",
        "rating": 5,
        "title": null,
        "text": "love it 😀😍🤩😍",
        "author": "Birdeye",
        "date": "7/19/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "398278890",
        "rating": 3,
        "title": null,
        "text": "Wasted money, not good at all. It's not worthy!",
        "author": "Suny",
        "date": "9/12/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "376489335",
        "rating": 1,
        "title": null,
        "text": "i ordered a baby walker for my grandson n i never received it . they sent it to my old address when i had gave them my new address. n they said they wouldnt send me  a new one or refund my money back on to my card. i will never shop with walmart again n that includes my whole family.",
        "author": "Linette",
        "date": "2/22/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      }
    ],
    "total_reviews": 10,
    "review_summary": {
      "average_rating": 4.6,
      "total_count": 305,
      "rating_distribution": {
        "1": 1,
        "2": 0,
        "3": 1,
        "4": 0,
        "5": 8
      }
    }
  },
  {
    "url": "https://www.walmart.com/ip/954302821",
    "title": "Giorgio Armani My Way Eau De Parfum Spray 3 oz",
    "description": "Giorgio Armani My Way Eau De Parfum Spray is a captivating fragrance that embodies the spirit of modern femininity. With its luxurious blend of floral and woody notes, it evokes a sense of empowerment and adventure. This sophisticated scent leaves a lasting impression, making it the perfect choice for the confident and cosmopolitan woman.",
    "price": {
      "current": 97.54,
      "currency": "USD",
      "display": "$97.54",
      "was_price": 128,
      "savings": null
    },
    "images": [
      "https://i5.walmartimages.com/seo/Giorgio-Armani-My-Way-Eau-De-Parfum-Spray-3-oz_63367a16-6eb5-4f42-b629-c3aa87d66434.8df322164140cd221ae512b9364a2c00.jpeg",
      "https://i5.walmartimages.com/asr/9c90fbea-71e6-4a42-90d6-88efff9be817.c946d620026eeb2aecbd0fb71b3473ae.jpeg",
      "https://i5.walmartimages.com/asr/063cd1d0-776c-45e0-b359-d78821958232.8cf3fc002d516b6229b83d41bcfc2925.jpeg",
      "https://i5.walmartimages.com/asr/f78031d2-0b67-41c8-9e0f-a101ac85242a.4ab502ab88cb82d3562be28cfe4d8704.jpeg",
      "https://i5.walmartimages.com/asr/ac8aaa2d-6343-4ae9-bc95-01cb10f4bd47.dac5d2c6dd730be7e2f03963cb22f92c.jpeg",
      "https://i5.walmartimages.com/asr/9204fc96-06ed-488d-9a73-458e92d9fad3.2a09593d04b1971772cdc3d684fcd55f.jpeg"
    ],
    "specifications": {
      "Brand": "Giorgio Armani",
      "Model": "3614272907690"
    },
    "brand": "Giorgio Armani",
    "model": "3614272907690",
    "sku": "4R8S68FTNU7T",
    "upc": null,
    "rating": 4.6,
    "review_count": 10188,
    "availability": "IN_STOCK",
    "category": [
      {
        "name": "Shop with Purpose",
        "url": "/cp/shop-with-purpose/6048744"
      },
      {
        "name": "Built for Better",
        "url": "/cp/built-for-better/8747893"
      },
      {
        "name": "For You",
        "url": "/cp/for-you/2975362"
      },
      {
        "name": "For you Health & Beauty",
        "url": "/cp/for-you-health-beauty/6430735"
      }
    ],
    "seller": "Jomashop",
    "scraped_at": "2025-09-15 01:33:13",
    "reviews": [
      {
        "review_id": "243176613",
        "rating": 5,
        "title": "beautiful summer scent",
        "text": "[This review was collected as part of a promotion.] Love love it , second time buying the same one. the scent last long, the following day its still there.",
        "author": "Czan",
        "date": "7/9/2025",
        "helpful_count": 1,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "244291408",
        "rating": 5,
        "title": "The journey this creation,takes you on,is sensual!",
        "text": "This is the most\"Amazing\"Fragrance,that I have ever worn?It takes you on an adventure,by lifting your spitits with a gorgeous mix of fruits and flower's,and wears down to a cedarwood,woody vanilla sensuality.I just cannot live without it!",
        "author": "Kay 12",
        "date": "8/27/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "242494482",
        "rating": 5,
        "title": "That's what makes me happy",
        "text": "I received a bottle of My Way Eau De Parfum with my purchase, and I am thrilled every time I use it. A real mesmerizing smell and unique mix of flora notes and wood. Stays all day long and ofcouse I receive compliments. I would definitely recommend it if someone would love somthing admiring and different.",
        "author": "Rina",
        "date": "6/8/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "240489865",
        "rating": 5,
        "title": "One of my Faves",
        "text": "This will always be a 5 star for me. Lasts all day, projects like crazy, and is a compliment getter! If you like tuberose which is a fave of mine you will Love My Way!",
        "author": "Asha",
        "date": "3/5/2025",
        "helpful_count": 1,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "1172676273",
        "rating": 5,
        "title": "A Journey in a Bottle",
        "text": "From the moment I first encountered Giorgio Armani's My Way Eau de Parfum, I knew it was more than just a fragrance—it felt like an invitation to journey inward, to explore facets of myself I hadn't yet discovered. With each spritz, I'm transported to a world of elegance and wonder, where every note seems to tell its own unique story.\n\nThe opening is fresh and bright, with bergamot and orange blossom swirling around me like a crisp breeze on a warm day. It feels as though I'm standing in the middle of a garden in full bloom, the sunlight filtering through petals, casting everything in a golden glow. Yet, it's not overwhelming—there's a softness that draws me in rather than dazzles me from afar.\n\nAs the fragrance deepens, the heart of tuberose and jasmine reveals itself, and I find it utterly captivating. These white florals dance on my skin, rich yet ethereal, making me feel grounded in my femininity without losing a sense of lightness. It's in this moment that I realize My Way is more than a scent—it's a reflection of who I am and who I aspire to be, graceful but unafraid, classic but always open to new possibilities.\n\nThe dry-down, with its soft cedarwood, warm vanilla, and white musk, lingers like a beautiful memory I can't quite let go of. It's warm and comforting, but never too heavy, staying with me in the most subtle, intimate way. I love how it feels personal, like it was crafted just for me, yet universal in its appeal.\n\nEven the bottle, with its elegant simplicity, speaks to the spirit of adventure and self-discovery that My Way encapsulates. Every time I pick it up, I'm reminded of the journeys I've taken—both literal and figurative—and those still ahead. In wearing it, I feel as though I'm embracing the world on my own terms, confident in my path, but always open to the beauty around me.\n\nFor me, My Way isn't just a fragrance—it's a reminder to stay true to myself while welcoming every new experience with grace.",
        "author": "emilie",
        "date": "10/14/2024",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": false,
        "photos": []
      },
      {
        "review_id": "398035878",
        "rating": 1,
        "title": "Wrong perfume was shipped",
        "text": "I ordered the Giorgio Armani My Way, I was sent the My Way Floral instead. This is not the same perfume. Don't order from this company. No where in the description, picture or name does it say this is the My Way Floral, but the Floral was the one I received shipped to me.",
        "author": "Katie",
        "date": "9/10/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "389309128",
        "rating": 1,
        "title": null,
        "text": "Sadly to say, but this is a dupe.  It's not authentic, the scent fades within minutes and it smells like watered down honeysuckle.  The fragrance doesn't last long on your body or clothing. The small sticker under the bottle isn't the same as the real MyWay perfume. I admit that I was hesitant because of the price is about $79 less than the real MyWay for the size I purchased. With that said, it goes with the cliche you get what you paid for. On the positive side, shipping was fast and it was well packaged. Walmart, I strongly suggest that you review and revise your policy and screening process for outside sellers who misled, hide or falsely advertise a product.",
        "author": "RL",
        "date": "6/21/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "375188140",
        "rating": 1,
        "title": null,
        "text": "The perfume arrived to my mailbox I picked it up opened the box and immediately noticed  the color was wrong it was more of an orange brown it smells horrible  instead of a pink color. I reached out to the 3rd party who handles this and was told they could give me 40%of what I paid  for it back. But has to be unopened",
        "author": "theresa",
        "date": "2/10/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "362838714",
        "rating": 1,
        "title": null,
        "text": "Very irresponsible seller, the perfume was purchased 2 weeks in advance as it was for a birthday gift and the seller did not send the perfume until after the estimated time. Not recommended, do not buy from this seller. I wrote to walmart and they didn't solve the problem either, even though I have a walmart membership. Irresponsible seller and walma",
        "author": "Jorge",
        "date": "11/8/2024",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "238639873",
        "rating": 1,
        "title": "Customized Text fades away!!",
        "text": "I got this for my dear mother for Christmas and not only it was a hardship customizing the bottle online. Two days after she received the bottle, the words began to fade away. How can this be a special gift if the most special part of the perfume (Aside from the aroma) fades away.",
        "author": "Anonymous",
        "date": "12/31/2024",
        "helpful_count": 1,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      }
    ],
    "total_reviews": 10,
    "review_summary": {
      "average_rating": 4.6,
      "total_count": 10188,
      "rating_distribution": {
        "1": 5,
        "2": 0,
        "3": 0,
        "4": 0,
        "5": 5
      }
    }
  },
  {
    "url": "https://www.walmart.com/ip/5314190515",
    "title": "Zinus Cooling Airflow 10\" Hybrid Mattress in a Box, Adult, Twin",
    "description": "Experience the perfect sleep without spending too much! This mattress has a medium feel and a cooling Airflow memory foam top layer that keeps you comfortable all night. The individually wrapped coils provide personalized support and relieve pressure on achy joints. It's an eco-friendly mattress that ships in a compact box, reducing its carbon footprint. Plus, it comes with a 10-year limited warranty for your peace of mind. Age Group: Adult, Universal.",
    "price": {
      "current": 114,
      "currency": "USD",
      "display": "$114.00",
      "was_price": 139.99,
      "savings": null
    },
    "images": [
      "https://i5.walmartimages.com/seo/Zinus-Cooling-Airflow-10-Hybrid-Mattress-in-a-Box-Adult-Twin_1c0eff26-b11c-4b75-8f90-f04ae15f915b.3ddf00d26cefac26ca2761fa4f33fff9.jpeg",
      "https://i5.walmartimages.com/asr/77a8e821-1a44-436f-a01c-f03de273fbb4.e6bbd5b668bf261feae97b5477dea114.jpeg",
      "https://i5.walmartimages.com/asr/e112e07b-3dfa-4b47-8851-d1dd80270459.062c5805a022e4efea46713bfe37ab91.jpeg",
      "https://i5.walmartimages.com/asr/5fcb1430-4fdc-402c-9057-da01849f41d7.ec40fa20839df10a075f9c97b5915bbe.jpeg",
      "https://i5.walmartimages.com/asr/e2f33d6b-0006-4ea1-979a-3cd4b3f1f65d.a0450af7bddb93d17dace87f22be6692.jpeg",
      "https://i5.walmartimages.com/asr/7d9bd3c1-bb86-4920-8712-a668ccd173a5.0469721dde61bee30ce152d260b0d1cb.jpeg",
      "https://i5.walmartimages.com/asr/c73e6f90-5c15-49fe-b84f-9c9a548a5695.fb90cb5fe70289d57308f0b553de11f4.jpeg",
      "https://i5.walmartimages.com/asr/804a95a6-add1-472b-b874-f9247391ddd0.431fbb57c1cf380dd447c7efbfcfddde.jpeg",
      "https://i5.walmartimages.com/asr/4d63f44f-fade-4ff5-b51e-63a2316fe649.362450b23b64330b3e01f9af57b5bbac.jpeg",
      "https://i5.walmartimages.com/asr/48fa1c46-d9f3-4fb3-8ab5-3c4c1bd224b9.b302a9c340253de96a379c3bf5994bab.jpeg"
    ],
    "specifications": {
      "Brand": "Zinus",
      "Model": "OHBD-10T",
      "UPC": "841550370225"
    },
    "brand": "Zinus",
    "model": "OHBD-10T",
    "sku": "1VY0BZWOGBCF",
    "upc": "841550370225",
    "rating": null,
    "review_count": null,
    "availability": "IN_STOCK",
    "category": [
      {
        "name": "Home",
        "url": "/cp/home/4044"
      },
      {
        "name": "Furniture",
        "url": "/cp/furniture/103150"
      },
      {
        "name": "Mattresses & Accessories",
        "url": "/cp/mattresses-accessories/539386"
      },
      {
        "name": "Hybrid Mattresses",
        "url": "/cp/hybrid-mattresses/1231583"
      }
    ],
    "seller": "Walmart.com",
    "scraped_at": "2025-09-15 01:34:16",
    "reviews": [
      {
        "review_id": "389663139",
        "rating": 5,
        "title": "Good but springs hybrid not preferred",
        "text": "I had the all foam version and I like it better than this one with spring hybrid , but this is still quite comfortable and a lot better than many mattresses out there , I prefer the spa sensations all foam version for my chronic lower  back pain with disc herniations that made w huge difference in my sleep and overall health",
        "author": "anonymous",
        "date": "6/24/2025",
        "helpful_count": 3,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "366516533",
        "rating": 5,
        "title": "Mad I didn't find this sooner!",
        "text": "This has got to be the best purchase that I've made in a long time. I have bought bed in a box type mattresses before, but never a hybrid where it contained memory foam and springs. This is for my sister who is 29 %26 6 foot tall, extremely lanky and has scoliosis in her back. She's been sleeping on a daybed for a little over six months now and at first she loved it, but eventually, the thinner mattress just wasn't cutting it. We tried buying foam toppers and eventually decided to just buy a mattress we could use without a boxspring to replace it. She has a developmental delay and will be with me as long as we're both kicking. She never really explained how bad the old mattress was hurting her but once I got the bed completely expanded and put on top of her bedframe I kid you not this girl was asleep within 20 minutes of laying down. A girl who usually stays up hours watching old reruns of her favorite TV shows. We got it on a black Friday deal for $70 and I seriously cannot believe the quality even if this bed were only hold up two years. I am beyond satisfied!",
        "author": "Maryann",
        "date": "12/7/2024",
        "helpful_count": 28,
        "not_helpful_count": 1,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "382965818",
        "rating": 5,
        "title": null,
        "text": "The mattress box it arrived in was a good strong sturdy cardboard and the plastic it was wrapped in was strong like clear tarp material. It was well-protected and secure inside. I like the mattress - it's firm and just what I wanted for the price. The directions were clear and easy to follow.",
        "author": "WalmartCustomer",
        "date": "4/23/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "389000811",
        "rating": 5,
        "title": "Hybrid Mattress",
        "text": "I highly recommend this mattress. It came when it was supposed to be delivered. It is better than I expected it to be from a sight unseen mattress. The quality is very good. The price was good.\n It is very comfy to our grandchildren when we have sleepovers.",
        "author": "Paula",
        "date": "6/18/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "360627792",
        "rating": 3,
        "title": "Paid for a 12-inch mattress but received a 10-inch",
        "text": "I'm rating 3 stars because even after waiting the minimum of 72 hours per the provided instructions, my mattress still didn't inflate to the entire 12 inches. It only inflated to 10 inches. It is now day 7, and the height of the mattress is still at 10 inches (please see pictures). I measured the mattress in all areas. I'm very disappointed, because I feel cheated out of my money. If this was the case, I should've been charged for the less expensive 10-inch mattress instead of the more expensive 12-inch mattress. Other than feeling cheated out of my money, the mattress is a pretty decent mattress for my 10-year-old. I'm unsure of how it sleeps, however, my 10-year-old hasn't complained. Shipping took only a day or 2, which was a pretty good turnaround. The box appeared to have once been glued shut because I noticed glue on the box once I cut the packaging tape to open the box. However, the glue was not in tact. It appeared to have been tampered with. Like the box was opened, and then taped back together to repackage. If that makes any sense. The mattress itself didn't appear to have been tampered with. It was compressed and sealed in the plastic. Overall, I'm disappointed because I didn't get what I paid for. I paid for the 12-inch mattress, but received a 10-inch mattress. Buy at your own risk.",
        "author": "TopNotchRN",
        "date": "10/18/2024",
        "helpful_count": 5,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "397924592",
        "rating": 3,
        "title": null,
        "text": "This is a spring mattress. There may be some memory foam in there somewhere but really it's a spring mattress. It does spring up into a firm mattress but not without sinking down first for a second. The whole mattress shakes when one person moves so my wife got woken up a bunch of times. The spring also mean that there is a sensation of being decoupled from the floor so while it is firm is doesn't feel supporting because there some lateral wiggling going on. We tried to like it for weeks but ultimately returned it.",
        "author": "Estevao",
        "date": "9/9/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "395850670",
        "rating": 2,
        "title": "Too firm and sagging",
        "text": "The mattress description says it's firm, but the pictures show it's medium firm. The mattress turned out to be much firmer than we wanted. We're experiencing shoulder, neck and back pain after sleeping on it. We could try to solve it by adding an extra foam topper on top, but the main issue is that after 3 weeks of use, it's sagging on the spots we were sleep.",
        "author": "anonymous",
        "date": "8/19/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "391480493",
        "rating": 1,
        "title": "Junk! Garbage mattress!",
        "text": "Garbage! Do not waste your money! The sides have zero support, mattress is lop-sided, moves around on the frame (frame is garbage also) and it's undersized all the way around the frame too. Walmart will not refund and nobody will pick up for return because it's not packaged. It was shrink wrapped and in a box so there's no way to repackage. Not a happy customer and I've spent a fortune at Walmart the last few months because I've re-located .",
        "author": "Kimberly",
        "date": "7/11/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "398079612",
        "rating": 1,
        "title": "Never received item......",
        "text": "I never received Zinus Cooling Airflow 10\" Hybrid Mattress but I am getting charged for it which is ridulous paying for an item I never received.   I have been calling Walmart for over a week everyday regarding my refund.   I have spoke to numerous people in Customer Service and every person except for the person I spoke to today has been lying to me about getting a refund.  Telling me don't worry you will be getting a refund.  Talk about frustration.......\n\nUnfortunately I can not give a review for a mattress that I didn't receive.",
        "author": "Esther",
        "date": "9/10/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "388787446",
        "rating": 1,
        "title": null,
        "text": "It does not fit  a full mattress frame bed. i returned and there Estes company picked this up and still don't have my refund. dint purchase this. You wont get your money. there pick up people Estes pick up items and dont do there job to get your money back.",
        "author": "Mary",
        "date": "6/15/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      }
    ],
    "total_reviews": 10,
    "review_summary": {
      "average_rating": null,
      "total_count": null,
      "rating_distribution": {
        "1": 3,
        "2": 1,
        "3": 2,
        "4": 0,
        "5": 4
      }
    }
  },
  {
    "url": "https://www.walmart.com/ip/2703155849",
    "title": "PHANCIR Kitchen Faucet with Pull Down Sprayer, High Arc Single Handle Kitchen Sink Faucets with Pause Button Premium Brushed Nickel with Deck Plate Suit to 1 or 3 Holes",
    "description": "PHANCIR Kitchen Faucet with Pull Down Sprayer - Make life easy, Make kitchen different <br>\nWe started our dream by creating home appliances with durable materials. After years of success with our initial development, we researched original faucet options and expanded to designing smart faucets.<br>\nHigh-quality home appliances should be available to everyone without the added costs of a fancy label. We focus on form and function. We believe the true significance of technology is to enable more people to enjoy the wonderful world. <br><br>",
    "price": {
      "current": 24.98,
      "currency": "USD",
      "display": "$24.98",
      "was_price": 53.99,
      "savings": null
    },
    "images": [
      "https://i5.walmartimages.com/seo/PHANCIR-Kitchen-Faucet-Pull-Sprayer-High-Arc-Single-Handle-Kitchen-Sink-Faucets-Pause-Button-Premium-Brushed-Nickel-Deck-Plate-Suit-1-3-Holes_691fee3b-b246-45f7-a0f6-03e9f9010c19.70abb659ef441178f6fc1e3d24834760.jpeg",
      "https://i5.walmartimages.com/asr/21088372-b92a-43f4-8f01-4dfb8a2253b7.c1653c63810433a81e0fa226d21dd5c2.jpeg",
      "https://i5.walmartimages.com/asr/8b899afc-fdea-424e-863c-621092c745d2.789c8101446e88382eca347fa17c3388.jpeg",
      "https://i5.walmartimages.com/asr/539b06de-65f8-4783-acf1-341ddacda135.6607073c58b3207b27fdabda3dfb76f1.jpeg",
      "https://i5.walmartimages.com/asr/59bdef38-d381-48a4-95a7-cd71b90e10af.cde86fdbb7b9087cde56771447b0ad7a.jpeg",
      "https://i5.walmartimages.com/asr/4b3e6b33-d9b8-4937-94b5-921910edd199.9f826503c4fb92bf2ea6bdf86009d778.jpeg",
      "https://i5.walmartimages.com/asr/34c5eb23-1003-40e8-8d36-4848300c9f95.46ce7adbd49ff6ffbfd187a8740124d4.jpeg",
      "https://i5.walmartimages.com/asr/25f2a007-91c1-446f-8ec3-fc04cb7606e0.34a0bfb0d46edbcfad15d71521353df7.jpeg",
      "https://i5.walmartimages.com/asr/6a42aeca-1533-4230-850f-3ae1425c234e.6e9cc2c39e91b913806aa7a5979d8c23.jpeg",
      "https://i5.walmartimages.com/asr/99ee2b6e-0f36-4025-8ac0-6257ad88e21b.58431c0b1b6922ce7c28fd99706168b1.jpeg"
    ],
    "specifications": {
      "Brand": "PHANCIR",
      "Model": "2101",
      "UPC": "689323913640"
    },
    "brand": "PHANCIR",
    "model": "2101",
    "sku": "13Z69KJ23GUI",
    "upc": "689323913640",
    "rating": 4.3,
    "review_count": 2308,
    "availability": "IN_STOCK",
    "category": [
      {
        "name": "Home Improvement",
        "url": "/cp/home-improvement/1072864"
      },
      {
        "name": "Kitchen Renovation",
        "url": "/cp/kitchen-renovation/1071485"
      },
      {
        "name": "Kitchen Fixtures and Materials",
        "url": "/cp/kitchen-fixtures-materials/1230875"
      },
      {
        "name": "Kitchen Faucets",
        "url": "/cp/kitchen-faucets/1071511"
      },
      {
        "name": "Shop Kitchen Faucets by Type",
        "url": "/cp/shop-kitchen-faucets-by-type/6881538"
      },
      {
        "name": "Pull-Down Kitchen Faucets",
        "url": "/cp/pull-down-kitchen-faucets/2317301"
      }
    ],
    "seller": "Shenzhenxingdiwangluokejiyouxiangongsi",
    "scraped_at": "2025-09-15 01:35:17",
    "reviews": [
      {
        "review_id": "396098579",
        "rating": 5,
        "title": null,
        "text": "Thank you, So much it was a confusing at first trying to install this by myself but then I took a little break and re-assessed my situation  then realized  the plastic part which aligns  the hoses needed to be flipped over  everything finally got installed.. It was easy after I realized what I did wrong..  Since then I've been enjoying this easybto use faucet it's great..",
        "author": "Ron",
        "date": "8/22/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "391641095",
        "rating": 5,
        "title": null,
        "text": "I absolutely love this, and it looks great! I would definitely recommend having a second person to help hold it still while installing, but installation was pretty simple other than that.",
        "author": "Trisha",
        "date": "7/12/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "397943366",
        "rating": 4,
        "title": "Kitchen Sink  Faucet",
        "text": "I love the two ways it sprays. If you have children using it you might want to buy a high dollar heavy duty one. This is great for me, im careful when using it. It's only been a couple week's but i love it. Brushed nickel looks good, no fingerprints.",
        "author": "Crystal",
        "date": "9/9/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "391443917",
        "rating": 4,
        "title": "Looks great!",
        "text": "This is close to what I wanted as I didn't want to go all out in case I moved. It's sturdy and was easy to install. The spray is really powerful. Matte black and sleek.",
        "author": "anonymous",
        "date": "7/10/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "392652544",
        "rating": 3,
        "title": null,
        "text": "Nice to look at but very cheaply made. Could not assemble the faucet because the washer that keeps the whole thing in place came broke. You get what you payed for",
        "author": "findcola",
        "date": "7/19/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "389521012",
        "rating": 2,
        "title": null,
        "text": "I ordered this faucet because I had purchased a very similar one from this same website a couple years ago. The first one purchased still works fine, but this brand new one was leaking at the shut off valve, causing water to drip under the sink. It is currently getting boxed up for return.",
        "author": "Mike",
        "date": "6/23/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "394230431",
        "rating": 2,
        "title": "Don't Waste Your Time On This",
        "text": "It looked good and sounded good on paper, but the product was a cheap copy of a good product. I should have spent more time on the particulars rather than the specifics of what I was looking for.",
        "author": "Al",
        "date": "8/3/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "390656480",
        "rating": 1,
        "title": "Cheap",
        "text": "I will be returning, as it's leaking from the faucet housing. I can handle supply line issues and such, but can't do anything about the internal parts.",
        "author": "Vernon",
        "date": "7/3/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "393539708",
        "rating": 1,
        "title": "Piece of garbage",
        "text": "Not worth a penny, coz it can't even be secured with the nut it comes with. The nut just spins through the threads and never locks. Whole set goes straight to garbage. Save your money.",
        "author": "Yauhen",
        "date": "7/27/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "393433182",
        "rating": 1,
        "title": "Disappointment",
        "text": "When trying to assemble it, the ring that holds it together doesn't tighten.  It's like it is strip or not made for this for this facet.  I'm sending it back.",
        "author": "Joann",
        "date": "7/26/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      }
    ],
    "total_reviews": 10,
    "review_summary": {
      "average_rating": 4.3,
      "total_count": 2308,
      "rating_distribution": {
        "1": 3,
        "2": 2,
        "3": 1,
        "4": 2,
        "5": 2
      }
    }
  },
  {
    "url": "https://www.walmart.com/ip/527818837",
    "title": "RUNMUS Gaming Headset with Noise Canceling Mic for PS4, Xbox One, PC, Mobile, 7.1 Surround Sound Headphone with LED Light for Kids Adults",
    "description": "<strong>PRODUCT DESCRIPTION:</strong><br>\n<strong>50MM DRIVER DELIVERS SURROUND SOUND</strong>. Whether you're immersed in God of War or want to hear your enemies motion in Fortnite, PUBG or CS:GO, wearing a professional gaming headset does matter. With a 50mm driver, K2 PS4 headset offers an incredibly surround sound for both games and music.<br>\n<br>\n<strong>ERGONOMIC DESIGN &amp; PREMIUM MATERIAL</strong>. Gamers usually play games for many hours, so the comfort is also a key factor when choosing a Xbox one headset. We have tested our headsets for many years on hundreds of different heads, the retractable band and breathable ear pad make sure every player could enjoy the optimal wearing comfort.<br>\n<br>\n<strong>MULTIPLE PLATFORM COMPATIBILITY</strong>. This gaming headset with a 3.5mm audio jack is compatible with PC, PS4 controller, Xbox One controller(Please be noted about that: For xbox one controller 1537, a headset adapter for xbox one controller will be required to use this headset.), Nintendo Switch (audio), Nintendo New 3DS LL/3DS (audio), Nintendo 3DS LL/3DS (audio).<br>\n<br>\n<strong>NOISE CANCELING MICROPHONE</strong>. This PS4 headset provides high-end noise cancellation to enable you to chat to your fellow players with crystal clarity. If you wanna enjoy your valuable me-time without communicating with other players, you could turn off the mic by flipping the switch.<br>\n<br>\n<strong>100% QUALITY GUARANTEED &amp; 12-MONTH-WARRANTY</strong>. Every gaming headset will go trough a strict quality test process before sending out. We promised to bring the best quality gaming headset to our customer. From the day of purchase of gaming headset, we offer 12 months warranty to our customer. Every customer’s right is fully guaranteed during the warranty period.<br>\nThe professional gaming headset for game enthusiasts.<br>\n<br>\n<strong>SPECIFICATIONS</strong><br>\nHeadphones<br>\nDriver: 50mm<br>\nFrequency Range: 20Hz-20KHz<br>\nImpedance: 32Ohm<br>\nSensitivity: 105<br>\nInput Power: 20mW<br>\nCable Length: 7.22Feet / 2.2 meter<br>\nApprox. Weight: 12 ounces<br>\nLED working voltage: DC5V<br>\nMicrophone<br>\nMicrophone sensitivity: -38 dB<br>\nPick-up Pattern: omnidirectional<br>\nHeadset Jack: USB 3.5mm 4Pin<br>",
    "price": {
      "current": 19.69,
      "currency": "USD",
      "display": "$19.69",
      "was_price": 59.99,
      "savings": null
    },
    "images": [
      "https://i5.walmartimages.com/seo/RUNMUS-Gaming-Headset-with-Noise-Canceling-Mic-for-PS4-Xbox-One-PC-Mobile-7-1-Surround-Sound-Headphone-with-LED-Light-for-Kids-Adults_a988d1c2-ddcf-4f1c-a23c-6345c6f11eec.b39eff644b60c296175a6c9bb6a4f33b.png",
      "https://i5.walmartimages.com/asr/a1e9620e-a78b-436e-8228-179717696cec.ce945d0472e832dbb95a94f7cf9d8489.png",
      "https://i5.walmartimages.com/asr/8aa5ca6c-2cb5-49c9-8031-2399c5d6a66e.7bb1b03726d47c648eeebb079404d0b3.png",
      "https://i5.walmartimages.com/asr/889fe29f-cfee-420a-8218-438768e47e85.9ae91af1e5eefc54a21d5882ea9a5736.png",
      "https://i5.walmartimages.com/asr/b45332e7-be95-45c1-9c27-74125598ffaf.c3050881cfd22962bb73f4c7399c8516.png",
      "https://i5.walmartimages.com/asr/2caf439b-daed-4628-9783-f5a4bf0e88b5.1a490d04c9676477182106d29731f1ee.png",
      "https://i5.walmartimages.com/asr/7ba1ae33-dfe5-43f9-b3b8-fa03f8af623f.5d478695aee1a8ac3090ddbddb3589de.png",
      "https://i5.walmartimages.com/asr/b097f8ee-8340-42d0-a5d6-d32f61f0e14b.611a848d3d0ee58a11bba04d6c1f192d.png",
      "https://i5.walmartimages.com/asr/734ac146-19d5-4dd1-94d6-98f1880273a3.c202a6a9c2a3f117286a320613487697.png"
    ],
    "specifications": {
      "Brand": "RUNMUS",
      "Model": "VIPRB-K2 RED"
    },
    "brand": "RUNMUS",
    "model": "VIPRB-K2 RED",
    "sku": "31NMS9OBVZ1L",
    "upc": null,
    "rating": 4.1,
    "review_count": 1047,
    "availability": "IN_STOCK",
    "category": [
      {
        "name": "Electronics",
        "url": "/cp/electronics/3944"
      },
      {
        "name": "Computers, Laptops and Tablets",
        "url": "/cp/computers-laptops-tablets/1089430"
      },
      {
        "name": "PC Gaming",
        "url": "/cp/pc-gaming/7052607"
      },
      {
        "name": "PC Gaming Headsets",
        "url": "/cp/pc-gaming-headsets/2612600"
      },
      {
        "name": "PC Gaming Wireless Headsets",
        "url": "/cp/pc-gaming-wireless-headsets/3172886"
      }
    ],
    "seller": "Shen Zhen Shi Lang Tuo Dian Zi Shang Wu You Xian Gong Si",
    "scraped_at": "2025-09-15 01:36:20",
    "reviews": [
      {
        "review_id": "390597557",
        "rating": 5,
        "title": null,
        "text": "actually a really nice geadset for under 30 bucks. was a little tight on my head at first till i work it in. Great sound quality.  plenty loud enough.",
        "author": "Cryptic",
        "date": "7/3/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "387905525",
        "rating": 4,
        "title": "decent headphones",
        "text": "The headset doesn't light up like in the photo, and i have a pretty small head so they didnt fit properly. But they have great sound and good audio it does bleed through if you have something playing jn the background but good for the price.",
        "author": "milo",
        "date": "6/6/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "360657650",
        "rating": 4,
        "title": "affordable, comfortable gaming headset",
        "text": "I purchased two headsets because they only last a year for my son. I bought one for his birthday this time last year. He has a PS4 but he usually uses the headset when playing online games on his PC. I can't hear his PC and he can't hear me talking to him when he wears them. The mic is fine, too. This headset is a great value for most uses. My son does have a problem with audio bleed when playing YouTube videos in one browser window while playing video games in another browser window while using Discord chat. The others in the chat can her the singing from my son's YouTube videos but they don't hear the music. He has updated software. He tried plugging into different ports. He adjusted the volume on the video, the sound manager and elsewhere. If you are just listening to a video or using video chat or gaming, you should be fine. When you do several of these things at the same time, you may experience audio bleed. The headset is adjustable and comfortable even for my son's big head. The only other issue is that there isn't any website for the manufacturer to find troubleshooting tips. Since my son even wears out the more expensive headsets, we found these are comparable for a more affordable price.",
        "author": "Yvette",
        "date": "10/18/2024",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "393389799",
        "rating": 3,
        "title": "Headphones",
        "text": "These headphones are nice looking and was happy when they arrived. However the sound went out on the one side already and only had them a few weeks. Very disappointed.",
        "author": "sloppydeb",
        "date": "7/26/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "395847525",
        "rating": 3,
        "title": null,
        "text": "its okay i guess but im still trying to figure out how to make it where people can hear me. Other than that its got good sound Quilty and works really well",
        "author": "Connor",
        "date": "8/19/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "359054126",
        "rating": 3,
        "title": "Audio problems for standard remotes",
        "text": "The product is not what I expected. Audio for standard remotes is on one side only. There is no way to adjust both sides of the head set for volume and the head set is very heavy, making adjusting the set on your various times during play which is distracting.",
        "author": "Ronn",
        "date": "10/2/2024",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "387018661",
        "rating": 2,
        "title": null,
        "text": "So, the headset itself, works great, looks neat, has cross platform functionality, and would be an easy five star. My pump the breaks commment is the quality of the cord. we have already had to tape it and its only been in use for luke 2 or 3 weeks. It atill works but idk how long the cord will hold up. Disappointing that the quality compares this low compared to the performance.",
        "author": "Adam",
        "date": "5/29/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "393901203",
        "rating": 2,
        "title": null,
        "text": "stopped working way too soon.\ni dont use it a ton just for a competitive game that requires focus, but 2mos is way too soon for it to just die...also,\n\ndidnt like the separate usb port for just the lights. i dont keep the ps5 close to me so i have to plug it into the controller. An extra dangling useless cord basically in my eyes. if u want to used the lights just use a pc, not a great option for a contoller headset at all.",
        "author": "anonymous",
        "date": "7/31/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "383551595",
        "rating": 2,
        "title": null,
        "text": "Significant static if the connector is bumped. \n\nThis might not be an issue, but for use on xbox it must be connected to the controller unless you use a long usb extension cable.\n\nMight be ok for PC, BUT DON'T BUY FOR USE WITH XBOX.",
        "author": "SS",
        "date": "4/28/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "393934404",
        "rating": 1,
        "title": null,
        "text": "Opened them thought they were cool and hopefully work good but they didn't work in discord microphone doesn't pick up voice unless you are yelling at it so refunded it i do not recommend them.",
        "author": "Jason",
        "date": "8/1/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      }
    ],
    "total_reviews": 10,
    "review_summary": {
      "average_rating": 4.1,
      "total_count": 1047,
      "rating_distribution": {
        "1": 1,
        "2": 3,
        "3": 3,
        "4": 2,
        "5": 1
      }
    }
  },
  {
    "url": "https://www.walmart.com/ip/16344006899",
    "title": "Bing Beverage Healthy Energy Drinks, Bing Cherry, 12 oz (12 Pack)",
    "description": "Bing Cherry – Made with Black Cherry Juice\nPetey’s Original, BING, is what started it all. Bing was an immediate hit in 2016 when it was launched at Denver-area farmer’s markets.  BING was developed especially for cherry lovers. It captures that complex and authentic cherry flavor reminiscent of a tart, but not too sweet.  Imagine fresh cherries bought at the neighborhood grocer, juiced, carbonated, canned, and rushed to your home. That is BING! 12 oz Beverage, 24 Pack\n\nA carbonated, juice-based beverage containing 120mg of Caffeine, anti-oxidants, 5 B-Vitamins, Vitamin C, and 100mg of Ginseng\nA healthy alternative to other soft drinks and energy drinks which are often heavily sweetened and high in calories\nOnly 40 calories per can and only 5 grams of added sugar\nGluten & Dairy free\nVegan friendly\nNO high fructose corn syrup\nProudly 100% made in the USA",
    "price": {
      "current": 23.15,
      "currency": "USD",
      "display": "$23.15",
      "was_price": 28.95,
      "savings": null
    },
    "images": [
      "https://i5.walmartimages.com/seo/Bing-Beverage-Healthy-Energy-Drinks-Bing-Cherry-12-oz-12-Pack_361da5c0-4f7a-46dc-a11b-89723a2bc4dd.a6c18c3967bad68ceab76669082a61f5.png",
      "https://i5.walmartimages.com/asr/f2305901-e458-4bab-a98d-5e294fbc770e.bedffd4a6e07eb90fd8ef57a65d473bf.png",
      "https://i5.walmartimages.com/asr/ff9c0e7f-1c55-43b0-9e4d-aedb37418e51.f262c09726de6562b43d2d8d2053a28d.png",
      "https://i5.walmartimages.com/asr/72a040e7-ec7a-4d36-aa7f-c6b167648850.4558a0597ea006de7f4a697e7c001186.png",
      "https://i5.walmartimages.com/asr/c45be62a-1546-42dc-8d6b-fff2cde1d60c.69cf1945f7f0fea2affff52feef9f58f.png",
      "https://i5.walmartimages.com/asr/ac97bba7-5556-4c42-b334-fe524b0b89c1.1b7bf1d9f0d0b2bdae38ac6b94325f34.png",
      "https://i5.walmartimages.com/asr/4d14f79c-4136-4f4a-808e-e490efe447c8.e719d062da7603f88020a246f849644a.png",
      "https://i5.walmartimages.com/asr/ca2fec13-6935-49c5-9bc5-fbab6ac099f9.119f4f173b461b6efbe06d096502f61a.png"
    ],
    "specifications": {
      "Brand": "Bing",
      "UPC": "890817001266"
    },
    "brand": "Bing",
    "model": null,
    "sku": "5PBV36JPCEO8",
    "upc": "890817001266",
    "rating": 4.7,
    "review_count": 73,
    "availability": "IN_STOCK",
    "category": [
      {
        "name": "Food",
        "url": "/cp/food/976759"
      },
      {
        "name": "Beverages",
        "url": "/cp/beverages/976782"
      },
      {
        "name": "Energy Drinks",
        "url": "/cp/energy-drinks/9357528"
      },
      {
        "name": "Energy Drinks",
        "url": "/cp/energy-drinks/1688487"
      }
    ],
    "seller": "Bing Beverage Company",
    "scraped_at": "2025-09-15 01:37:17",
    "reviews": [
      {
        "review_id": "389607435",
        "rating": 5,
        "title": "I love Bing!",
        "text": "Crazy to think I have been drinking it for almost 10 years now! My work day mornings always consist of a Bing instead of coffee. Recently got my dad hooked as well. \n\nThe flavor is SO tasty, to me it is more like soda vs other energy drinks that taste like chemicals. It gives a noticeably good boost as well. I do also appreciate the smaller can size. Highly recommend !",
        "author": "Ashley",
        "date": "6/23/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "391626519",
        "rating": 5,
        "title": "Bing is great",
        "text": "Bing is the best energy drink! All the flavors are fruity and good, lightly carbonated, and have about as much caffeine as a cup of coffee. They don't have a strange chemical aftertaste, just yummy and refreshing!",
        "author": "Laney",
        "date": "7/12/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "387299207",
        "rating": 5,
        "title": "Best energy drink out there",
        "text": "I love these. I drink one everyday. I know they aren’t advertising this, but I feel like they make my mind sharper! And they are delicious. Drinking one is literally my happy time!",
        "author": "Reed",
        "date": "5/31/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "386410865",
        "rating": 5,
        "title": "GREAT PRODUCT",
        "text": "This a great product I was bothered by gout. The cherry juice that this product has as ingredient for more than two years now I have not had an episode.",
        "author": "Mitch",
        "date": "5/23/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "352796352",
        "rating": 5,
        "title": "BING HEALTH INTO YOU MORNING WITH A CUP OF CHERRY",
        "text": "The Best energy drink on the market. The grocery store I shop at could not keep them on the shelf. Last week they took them off the shelves :(  Now I have to order them. I think the competition was thinking we would buy another product NOT A CHANCE .....  BING IS THE BEST !",
        "author": "sherry",
        "date": "8/1/2024",
        "helpful_count": 2,
        "not_helpful_count": 1,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "389835480",
        "rating": 5,
        "title": null,
        "text": "I love the natural cherry flavor of this beverage. It is just the right amount of caffeine to start my day.",
        "author": "Allisa",
        "date": "6/26/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "397159379",
        "rating": 5,
        "title": null,
        "text": "The only problem is we sent these to my elderly parents as we are visiting and they were left at the end of the driveway and not at the door.",
        "author": "Casey",
        "date": "9/1/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "397188942",
        "rating": 5,
        "title": null,
        "text": "I have been drinking Petey's Bing since 2009, I've had trouble finding it but Walmart is still able to deliver it!",
        "author": "Sara",
        "date": "9/2/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "386135932",
        "rating": 3,
        "title": "Great product; poor shipping",
        "text": "The product is fantastic, but it was shipped by Walmart poorly. They put two heavy cases side-by-side in a huge box, so the cases were sliding around in the box and some of the cans burst.and others were shaken badly (this is a carbonated be rage, so they lost carbonation).",
        "author": "anonymous",
        "date": "5/20/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "392603645",
        "rating": 3,
        "title": "Shipping issue, drink was good",
        "text": "Love Bing Cherry Drinks.  I have been drinking them for years.  They have helped me get energy when I had very little.\nThis last package came damaged.  There were three cans dented.  Haven't opened them to see if the taste or quality was affected.",
        "author": "anonymous",
        "date": "7/18/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      }
    ],
    "total_reviews": 10,
    "review_summary": {
      "average_rating": 4.7,
      "total_count": 73,
      "rating_distribution": {
        "1": 0,
        "2": 0,
        "3": 2,
        "4": 0,
        "5": 8
      }
    }
  },
  {
    "url": "https://www.walmart.com/ip/5351994960",
    "title": "YUOY Wireless Controller Compatible with P-4/P-4 Slim/P-4 Pro, Remote Game Joystick, Black",
    "description": "Why Choose YUOY Wireless P4 Controller Compatible?<p>\nThe YUOY Wireless Controller for P4 combines premium features with exceptional performance,  it retains all the essential functions of the original, including motion control, dual vibration, and a touchpad. Additionally, it is equipped with a 600mAh rechargeable battery, extending gaming time. Whether you're gaming on your P4, P4 Slim, P4 Pro, or PC, this controller delivers a comfortable, immersive, and responsive gaming experience.<br>\nPerfect for Gamers Who Want:<br>\nA budget-friendly alternative to the original controller.<br>\nReliable performance and compatibility across multiple platforms.<br>\nComfortable, ergonomic design for long gaming sessions.<br>\nEssential features like motion control, vibration feedback, and a touchpad.<br>\nUpgrade your gaming setup with the YUOY Wireless P4 Controller today and enjoy a premium gaming experience without breaking the bank!</p>",
    "price": {
      "current": 15.99,
      "currency": "USD",
      "display": "$15.99",
      "was_price": 29.99,
      "savings": null
    },
    "images": [
      "https://i5.walmartimages.com/seo/Wireless-Controller-for-P4-Remote-Game-Joystick-Compatible-with-P-4-P-4-Slim-P-4-Pro-Black_0d67d8b0-bb66-47d6-aedb-65f231d44f8d.0000352bad15ff8ecbbcf13d9eeafff2.jpeg",
      "https://i5.walmartimages.com/asr/d680fc43-e44b-426d-b633-dcf611791f15.089e4314fc2d483c1edfcfe158441cd9.jpeg",
      "https://i5.walmartimages.com/asr/6e21ff92-fd3e-4ee1-b8eb-01135207b69b.299884aa2cf87a58f465e2b8c48db88b.jpeg",
      "https://i5.walmartimages.com/asr/7763e842-3c98-4619-bf77-30da46a19dfb.28376271b7243e1e7befe7c7284335f2.jpeg",
      "https://i5.walmartimages.com/asr/7799a778-034c-4e86-ab20-9e5885a69806.9a3ab712434872a8a59e1a697e563cd6.jpeg",
      "https://i5.walmartimages.com/asr/3d93b5f3-f2bc-4530-9583-15ed6514e018.edc68803d725c7163dd0961ac2227123.jpeg"
    ],
    "specifications": {
      "Brand": "YUOY",
      "Model": "P41",
      "UPC": "783852885802"
    },
    "brand": "YUOY",
    "model": "P41",
    "sku": "2FRJQTMQDQHZ",
    "upc": "783852885802",
    "rating": 3.9,
    "review_count": 854,
    "availability": "IN_STOCK",
    "category": [
      {
        "name": "Video Games",
        "url": "/cp/video-games/2636"
      },
      {
        "name": "PlayStation",
        "url": "/cp/playstation/5170403"
      },
      {
        "name": "PlayStation 4 Consoles, Games, Controllers + More",
        "url": "/cp/playstation-4-consoles-games-controllers-more/1102672"
      },
      {
        "name": "PlayStation 4 (PS4) Accessories",
        "url": "/cp/playstation-4-ps4-accessories/1106097"
      }
    ],
    "seller": "shenzhenshiyoupinyidianziyouxiangongsi",
    "scraped_at": "2025-09-15 01:38:19",
    "reviews": [
      {
        "review_id": "393787338",
        "rating": 5,
        "title": null,
        "text": "My son's controller stopped working on a 3 week trip he was taking and he needed a new one ASAP. We found this one on the Walmart app and not only was the price great compared to other controllers, but it was the only reasonably priced option that would be delivered in a couple",
        "author": "jason",
        "date": "7/30/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "395518943",
        "rating": 5,
        "title": "very excellent controller",
        "text": "I like that the controller connected just as soon as it soon as I plug the cord into it and then it started working fine and I I want to thank you for my controller",
        "author": "phillip",
        "date": "8/16/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "353797159",
        "rating": 4,
        "title": "Almost there!",
        "text": "The controller works great and perfectly! My only issue that made me rate 4 is that the shipping was a bit messed up. I don't think the one who was delivering was paying much attention cause they sent the package a few houses down. We have our house number right by the door and so does the person the package was sent to. This probably doesn't have to do much with walmart but rather the delivery company, still wanted to put it in case though!\n\nThank you, the controller works well and my sister is happy with her new controller.",
        "author": "Axel",
        "date": "8/11/2024",
        "helpful_count": 2,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "396732852",
        "rating": 4,
        "title": null,
        "text": "I do not like ordering stuff online. So I was mildly disappointed when vermilion did not have it on hand. It is also a pain to get hooked up but that is not anything you can do. So it's okay",
        "author": "Alex",
        "date": "8/28/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "396079231",
        "rating": 3,
        "title": null,
        "text": "I originally gave this a great rating. Its lighter than the name brand so its obvious lower quality but it worked great and looked great, charged well. BUT It was purchased middle of June, its middle of August and the buttons just randomly stopped working today. You get what you pay for $20 for 2 months.",
        "author": "Merisha",
        "date": "8/21/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "379483450",
        "rating": 2,
        "title": null,
        "text": "The joystick is extremely stiff and borderline impossible to use. It's also no Sony built or authorized, adding to that the built in speaker is incredibly bad. Along with that you cannot use this controller to talk using a plug in mic, it destroys your voice and volume for other players.",
        "author": "Latayveon",
        "date": "3/21/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "390078099",
        "rating": 1,
        "title": "WORST CONTROLLER EVER",
        "text": "This is by far the worst controller I ever bought. By day 2 the controller stop functioning correctly. It disconnects while fully charged though it'll say it's not charged, in turned off in the middle of games, even when trying to “charge it” it'll charge for a bit then stop. I would've returned it should it not be such a hassle and inconvenience to do so. DO NOT BUY THIS CONTROLLER IT IS TRASH.",
        "author": "daneeka",
        "date": "6/28/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "394455484",
        "rating": 1,
        "title": null,
        "text": "It came with stick drift and it kept powering on and off whether or not had a full charge or not did not matter it just kept turning on and off on and off on and off so playing with it was not workable",
        "author": "Jacob",
        "date": "8/5/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "368405845",
        "rating": 1,
        "title": null,
        "text": "This is not a controller any gamer would want to buy. At first it works but once you start getting into your game the buttons start to stick even though you're not pressing anything or the joystick will continue to move you even after you've taken your thumb off of it. I will never buy this brand ever again it was a waste of my money",
        "author": "Brittani",
        "date": "12/19/2024",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "373067112",
        "rating": 1,
        "title": "Circle button is broken",
        "text": "I purchased this PlayStation 4 controller hoping it would be a reliable alternative to the original Sony controller. Unfortunately, it's been a huge letdown.\n\nThe biggest issue is that the back button simply doesn't work at all. No matter how much I press it or try to troubleshoot, it's completely unresponsive. For a controller, that's a critical failure, as it makes playing certain games frustrating or even impossible.",
        "author": "Thaddeus",
        "date": "1/21/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      }
    ],
    "total_reviews": 10,
    "review_summary": {
      "average_rating": 3.9,
      "total_count": 854,
      "rating_distribution": {
        "1": 4,
        "2": 1,
        "3": 1,
        "4": 2,
        "5": 2
      }
    }
  },
  {
    "url": "https://www.walmart.com/ip/3910421282",
    "title": "NELEUS Womens High Waist Ankle Yoga Leggings Workout with Two Pockets,Black,US Size L",
    "description": "We are the official seller of NELEUS on Walmart. When purchasing, please check out the NELEUS brand store, you can see more NELEUS products here: https://www.walmart.com/brand/neleus/10002162<br>\n\n<br>If you have any doubts before purchasing, or about the after-sales problems after purchasing, please feel free to contact us.<br>\n\n<br>Please refer to our size chart to select the appropriate size. Our products size follow the “US size” on our product label.<br>\n\n<br>NELEUS Womens High Waist Ankle Yoga Leggings is made of 85% Polyester and 15% spandex. It is made of super soft skin-friendly fabric with excellent moisture absorption and sweat removal. It can keep comfortable and dry all day even during exercise. The use of four-way elastic fabric, super elastic slim-fit, can promote compression and support, but also provide greater freedom of movement, movement is not restricted, perfect for yoga, jogging, fitness, exercise and other occasions.",
    "price": {
      "current": 17.99,
      "currency": "USD",
      "display": "$17.99",
      "was_price": 29,
      "savings": null
    },
    "images": [
      "https://i5.walmartimages.com/seo/NELEUS-Womens-High-Waist-Ankle-Yoga-Leggings-Workout-with-Two-Pockets-Black-US-Size-L_54d60407-6b05-4a54-a7b7-6f9e854418ee.a274427a9a1d592ec14c8486ec484003.jpeg",
      "https://i5.walmartimages.com/asr/66d4c902-d80a-4d43-93ab-bc5827d737a6.0d54d96a31a21b886be327828f923b62.jpeg",
      "https://i5.walmartimages.com/asr/e47d446b-c32c-463a-a3a1-17ba25030d0d.4cdd8622abc64fcdd9d743ced5c09d1c.jpeg",
      "https://i5.walmartimages.com/asr/54355cc8-7fd9-4e11-a148-7f17665a5028.aa1e1aa518d13e3790606be8b7c4ae49.jpeg",
      "https://i5.walmartimages.com/asr/a7886af6-8f26-4b56-b610-ce8d762ed6ff.501b26072e9d42b80a55a6f053bed058.png",
      "https://i5.walmartimages.com/asr/a7d4549e-4c2c-45c5-a68a-c9f66f4e3b08.4730b42d5827c19b81c493045c5dade5.png",
      "https://i5.walmartimages.com/asr/00e52a43-f611-4326-9f9e-183a6f33d973.446846448e981ed63b70c5fa98bca867.png",
      "https://i5.walmartimages.com/asr/658ece92-4b0a-4d88-a537-7ead541856f0.50e37ca13180e5bb4eba447d3722072b.jpeg"
    ],
    "specifications": {
      "Brand": "NELEUS",
      "UPC": "616943476286"
    },
    "brand": "NELEUS",
    "model": null,
    "sku": "7FZAZSKRBAW2",
    "upc": "616943476286",
    "rating": 4.6,
    "review_count": 1333,
    "availability": "IN_STOCK",
    "category": [
      {
        "name": "Clothing",
        "url": "/cp/clothing/5438"
      },
      {
        "name": "Womens Clothing",
        "url": "/cp/womens-clothing/133162"
      },
      {
        "name": "Womens Activewear",
        "url": "/cp/womens-activewear/3554910"
      },
      {
        "name": "Womens Workout Bottoms",
        "url": "/cp/womens-workout-bottoms/1690237"
      },
      {
        "name": "Workout Leggings",
        "url": "/cp/workout-leggings/4090632"
      }
    ],
    "seller": "Shen Zhen Nie Rou Si Ke Ji You Xian Gong Si",
    "scraped_at": "2025-09-15 01:39:29",
    "reviews": [
      {
        "review_id": "386083773",
        "rating": 5,
        "title": "Love having pockets.",
        "text": "I use these for work around the house, inside and out. Pockets also help. I used to get them for the compression mainly but now its mostly the freedom of movement, not something that gets hot like jeans and not as heavy either.  I like the womens, they seem to fit better and they are usaully less expensive and I like colors. Not something the mens usually do. They work well for playing with the dog.",
        "author": "Richard",
        "date": "5/20/2025",
        "helpful_count": 2,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "384978898",
        "rating": 5,
        "title": "I love the pockets!",
        "text": "I am a beta male and like the womens leggings. I think they fit me better, I like variety of colors (you just dont find with mens) Wearing womens I think also helps to show my personality.",
        "author": "Richard",
        "date": "5/10/2025",
        "helpful_count": 5,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "353788864",
        "rating": 5,
        "title": null,
        "text": "runs a little large so if you're not plus size or tall for your size i say size down 1 size. i wear a large and im short, i had to get a size M, still long but im a little fat.. for my high.",
        "author": null,
        "date": "8/10/2024",
        "helpful_count": 5,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "359869319",
        "rating": 5,
        "title": null,
        "text": "I purchased 3 pair in different colors. I like how they fit me , I purchased XL I’m 5’3 and I wear size 14 and I will be ordering the other colors. I love that they have pockets and they look and feels good on me.",
        "author": "phyllis",
        "date": "10/10/2024",
        "helpful_count": 3,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "395436952",
        "rating": 5,
        "title": null,
        "text": "Hey I am not a workout person but these pants are great. I bought them because I had to have a few surgery's and wanted something very comfortable to wear then. Now if I am having a day at home these are my first picks. I love cleaning the house in these too, they are easy to get in any position so you can do any of your cleaning. For the price these are a great pair of pants.",
        "author": "Vickie",
        "date": "8/15/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "393001346",
        "rating": 5,
        "title": "A Must Buy",
        "text": "These leggings aren't see through! Which is hard to find these days. Especially at an affordable price. True to size, fast delivery, would definitely reccomend. I definitely plan to buy more in other colors/patterns. I got these to wear at work. I load semi trucks by hand for 11hrs/day, so i needed something that would be flexible to move in, breathable, as well as non-see through and these will work great! ☺️\nSo if you have an active job like me, or need workout leggings, these will work great for you!",
        "author": "Alexa",
        "date": "7/22/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "388086848",
        "rating": 5,
        "title": "Quality %26 Comfort",
        "text": "I needed leggings %26 saw these on sale. I  wasn't sure what size I should order. However, after reading product description %26 the great customer reviews, I decided to get them (I ordered my regular size %26 they're   perfect!).  They fit beautifully, quality fabrication %26 workmanship...fits me like a glove but definitely comfortable! I'm going to order more!! 😊",
        "author": "Patricia",
        "date": "6/8/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "346211058",
        "rating": 5,
        "title": "someday I know I'm going to have to go back to jea",
        "text": "but until then I think I look pretty good in these new leggings and if I get compliments on my clothes I do tell the ladies to go to walmart.com they have much more variety and you get to pick your sizes so much better than at the store not the store ain't great",
        "author": "Karla",
        "date": "6/3/2024",
        "helpful_count": 3,
        "not_helpful_count": 1,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "357091321",
        "rating": 5,
        "title": "Happy With %2363  NELEUS Yoga Pants",
        "text": "The fit is perfect and they look great!  I used the Size chart and Fit Predictor when  I purchased these leggings.  I bought the Red and the Navy. I love the colors, even though the Red looks more like a Hot Pink. I really like the style and, of course,  the pockets!  These are now the most comfortable leggings I own.   They  will be great this Fall. I just ordered four more pairs!",
        "author": "GW",
        "date": "9/12/2024",
        "helpful_count": 2,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "363694578",
        "rating": 5,
        "title": "Order them!",
        "text": "They are true to size and fit just perfect, the pockets stretch and the waist line your pockets can fit anything you need to put in them and the pants are like a silky smooth fabric the only complain I have is the seams but other than that I highly recommended!",
        "author": "Allison",
        "date": "11/15/2024",
        "helpful_count": 1,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      }
    ],
    "total_reviews": 10,
    "review_summary": {
      "average_rating": 4.6,
      "total_count": 1333,
      "rating_distribution": {
        "1": 0,
        "2": 0,
        "3": 0,
        "4": 0,
        "5": 10
      }
    }
  },
  {
    "url": "https://www.walmart.com/ip/AND1-Men-s-Cushion-Quarter-Socks-12-Pack/870945481?athAsset=eyJhdGhjcGlkIjoiODcwOTQ1NDgxIiwiYXRoc3RpZCI6IkNTMDIwIiwiYXRoYW5jaWQiOiJJdGVtQ2Fyb3VzZWwiLCJhdGhyayI6MC4wfQ==&athena=true&athbdg=L1300",
    "title": "AND1 Men's Socks, Cushion Quarter Socks, 12 Pack",
    "description": "<p>Experience the ultimate in comfort with AND1 Men's Cushion Quarter Socks. Designed with the athlete in mind for superior comfort and fit, AND1 provides a performance sock that delivers. Constructed with a soft, plush footbed, this twelve-pack of socks cushions your feet and adds as a safeguard for impact absorption and friction reduction. These durable men's sports socks are made with a comfort stretch technology for a sustained, dependable fit.</p>",
    "price": {
      "current": 9.84,
      "currency": "USD",
      "display": "$9.84",
      "was_price": 10.98,
      "savings": null
    },
    "images": [
      "https://i5.walmartimages.com/seo/AND1-Men-s-Cushion-Quarter-Socks-12-Pack_3cf64792-0bec-4db0-846b-0cf2eff9aff0.edbcdbb50d3fdc40ee4ad4fed53b27b4.png",
      "https://i5.walmartimages.com/asr/563ac8b0-e51d-453e-8bf7-4fdf83ec294c.d72ef9cfef3cd739a474fca721d32f98.jpeg",
      "https://i5.walmartimages.com/asr/896f64d8-e0f7-429d-9db7-b10d7fe0a84c.ebda59366b2ee11a630a9b58783110e3.jpeg",
      "https://i5.walmartimages.com/asr/c4e9bcac-87e7-4fc3-930c-9b03f9b31b52.7bc483f55bce59e2f4e4103bf815fcd2.png",
      "https://i5.walmartimages.com/asr/26deb94f-428d-4ced-a190-9c19a494659c.3cd397301a272a4e30eb25c4992ca3a7.png",
      "https://i5.walmartimages.com/asr/065014c0-c95b-4e72-812e-5ec8b5c81381.879fb753ef2bd0231ad27564c934bfed.jpeg",
      "https://i5.walmartimages.com/asr/815ed8e3-ba3f-4ca6-8b38-3bed58cfe206.ca492e1d347c5976608969a8a2edf45d.png",
      "https://i5.walmartimages.com/asr/437312fb-104e-45c4-9e50-e0d3b5bc32de.e6762bdab3ae2f4eb646244377d4787c.jpeg",
      "https://i5.walmartimages.com/asr/79a66a2c-a5e7-4cd6-bfbb-46c3188e1145.b903094654959e1be7a440c81a02df5c.jpeg",
      "https://i5.walmartimages.com/asr/39f77e4a-d50f-4955-bf3d-0c274b4f1050.e0c0970464e20f89fe870edf3200e140.jpeg",
      "https://i5.walmartimages.com/asr/556fa23d-7389-47b1-a9c5-2729490c00cf.85917c5c5841be97478f5072a1f3957c.jpeg",
      "https://i5.walmartimages.com/asr/f8bfe006-e620-413d-a9f1-c6f07f4d2a66.0755031667aeab04ec145a7bab58c392.jpeg"
    ],
    "specifications": {
      "Brand": "AND1",
      "Model": "886028347477",
      "UPC": "886028347477"
    },
    "brand": "AND1",
    "model": "886028347477",
    "sku": "3K7LPMIZE68L",
    "upc": "886028347477",
    "rating": 4.7,
    "review_count": 3297,
    "availability": "IN_STOCK",
    "category": [
      {
        "name": "Clothing",
        "url": "/cp/clothing/5438"
      },
      {
        "name": "Mens Clothing",
        "url": "/cp/mens-clothing/133197"
      },
      {
        "name": "Mens Socks",
        "url": "/cp/mens-socks/4757428"
      },
      {
        "name": "Mens Socks",
        "url": "/cp/mens-socks/4033504"
      }
    ],
    "seller": "Walmart.com",
    "scraped_at": "2025-09-15 01:40:40",
    "reviews": [
      {
        "review_id": "395082342",
        "rating": 5,
        "title": "I will keep purchasing",
        "text": "I have purchased these for my son for years.  He doesn't like the no show or the longer length socks and prefer these.  They last a long time but I purchase a new set every year for school.  Price for the amount is a good value to me. Fit is true to size, they are not think socks,  and they do not shrink in the wash.",
        "author": "Carrie",
        "date": "8/12/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "388760284",
        "rating": 5,
        "title": "Not Too Shabby",
        "text": "These socks were the best bang for the buck while being able to receive them the same day. quality is not bad, and they feel good, not annoying on feet.",
        "author": "anonymous",
        "date": "6/15/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "395186594",
        "rating": 5,
        "title": null,
        "text": "The quality of the socks feel soo comfortable. They are very soft . I also washed them twice now and the new feel of the material is still .  100%true to size",
        "author": "susie",
        "date": "8/13/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "397029057",
        "rating": 5,
        "title": null,
        "text": "Purchased them for son and he loves them. He likes the feel and the quality is very nice. He wears them daily and no holes. We have had them for 2 months.",
        "author": "Jen",
        "date": "8/31/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "386524031",
        "rating": 4,
        "title": null,
        "text": "I bought a pack of the mens And1 socks for my dad. he just needed some in an emergency because he forgot to bring any socks with him. so for the value I ordered these. so far they have done him just fine.",
        "author": "Rora",
        "date": "5/24/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "392875769",
        "rating": 4,
        "title": "Solid pair of socks",
        "text": "Pretty much the only socks I buy. These do eventually get holes in them, but they're cheap enough that I'm fine only getting 3-6 months of use out of them (50% chance I'll lose them before that anyway).",
        "author": "anonymous",
        "date": "7/21/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "390702766",
        "rating": 3,
        "title": "Good socks except the ankle is very tight fitting",
        "text": "My only complaint about these socks is that the ankle is too tight. At the end of the day, I see how they are cutting into my leg and affecting my circulation. I won't be buying these again, but if you aren't bothered by a tight fitting ankle, these socks are of good quality and a great value for the 12 pack.",
        "author": "anonymous",
        "date": "7/4/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "393695243",
        "rating": 1,
        "title": "Online ordering sucks",
        "text": "Socks fine,  the Walmart online order service sucked, they billed me the correct item but pulled the wrong item on two items, it was a pick up order, went to the stores service desk, but wouldn't help, said it was an online issue, even though THEY pulled the wrong item, so I'm with their on line, and that store",
        "author": "karl",
        "date": "7/29/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "392053195",
        "rating": 1,
        "title": null,
        "text": "the only thing I don't like is that the fact that I ordered this product and then I go to get it and it's been delivered to the wrong house now I'm thinking about suspending my Walmart membership because I don't know or anything because it's not going to come to the right address",
        "author": "Timothy",
        "date": "7/16/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      },
      {
        "review_id": "391727034",
        "rating": 1,
        "title": "Missing from order",
        "text": "Unable to review item because it was not with my order.  This isn't the first time my order has come up short.  When I called to inquire, no extension answered.",
        "author": "RenitaB",
        "date": "7/13/2025",
        "helpful_count": 0,
        "not_helpful_count": 0,
        "verified_purchase": true,
        "photos": []
      }
    ],
    "total_reviews": 10,
    "review_summary": {
      "average_rating": 4.7,
      "total_count": 3297,
      "rating_distribution": {
        "1": 3,
        "2": 0,
        "3": 1,
        "4": 2,
        "5": 4
      }
    }
  }
]